[
  {
    "id": 0,

    "image": "service1.png",
    "title": "Real Estate & Construction",
    "p1": "Developing, constructing, or expanding a new business operation usually involves the acquisition of real estate properties.",
    "p2": "We represent private and institutional investors, property owners, developers, and financiers in a broad spectrum of transactions such as:",
    "li1": "Drafting and negotiating real estate contracts and other conveyance documents",
    "li2": "Facilitating real estate development plans",
    "li3": "Perfecting title to real estate",
    "li4": "Structuring the financing of complex real estate transactions, including mortgages",
    "li5": "Representing companies in buying and selling of real estate",
    "li6": "Ensuring regulatory and permit compliance with pertinent laws and authorizing bodies",
    "li7": "Executing lease agreements between various entities"
  },
  {
    "id": 1,

    "image": "service2.png",
    "title": "Corporate & Commercial Law",
    "p1": "The dynamics and frameworks of laws, policies and regulation are continually evolving.",
    "p2": "Together with our clients, we craft bespoke legal solutions that meet the requirements of modern enterprises in the following ways:",
    "li1": "Company secretarial services",
    "li2": "Corporate governance",
    "li3": "Regulatory compliance",
    "li4": "Company Formation and Joint Ventures",
    "li5": "Support to in-house legal teams",
    "li6": "Nominee Services",
    "li7": "General Legal advisory",
    "li8": "Due diligence and sustainability reporting"
  },
  {
    "id": 2,

    "image": "service3.png",
    "title": "Energy, Power, Infrastructure",
    "subtitle": "Shipping & Maritime Law:",
    "p1": "Shipping and Maritime are the foundation of international transport and trade. Roothe - Kharis & Partners provide services to Clients across a spectrum of the shipping and maritime industry including ship owners, ship managers, ship operators, stevedores, cruise lines, non-vessel-operating common carriers, salvage companies, shipyards, manning agents and insurers.",
    "p2": "We work with a wide range of experts across the maritime industry including ship brokers, marine engineers, financial consultants, marine underwriters to provide the following services:",
    "li1": "Representation in acquisitions, sales and purchases of marine vessels",
    "li2": "Ship registration and documentation with regulatory institutions",
    "li3": "Advisory on vessel financing, vessels ownership, shipping",
    "li4": "Manning",
    "li5": "Drafting and reviewing chatter party contracts ",
    "li6": "Ship arrest, mortgages, claims & liens and release",
    "li7": "Advisory and representation on accidents, salvage and damage claims",
    "li8": "Carriage of goods"
  },
  {
    "id": 3,

    "image": "service4.png",
    "title": "Venture Capital and Private Equity",
    "p1": "At Roothe-Kharis, we support the objectives of our clients by providing holistic advisory on transactions across the venture capital and private equity life cycle from the pre-transaction phase to exiting an investment.",
    "p2": "We are experienced in advising on relevant fund structures, sourcing and screening deals, conducting due diligence including corporate governance requirements, negotiating and structuring deals, and drafting transaction documents (such as valuation agreements, Offer Documents, Partnership Agreements, Trust Deeds, Constitution Documents, Management Agreements, Investment Subscription Agreements, Side Letters)."
  },
  {
    "id": 4,

    "image": "service5.png",
    "title": "Labour and Employment Relations",
    "p1": "The fortification of various legislations and regulatory requirements pose uncertainties in the relationship between employers and employees.",
    "p2": "Roothe-Kharis & Partners provide sound, practical and comprehensive solutions to SMEs and Large corporations across banking, oil and gas, construction, energy, banking, telecommunications, manufacturing, fast-moving consumer goods and non-profits sectors on:",
    "li1": "Processing expatriate quotas and immigration requirements for expatriate employees",
    "li2": "Drafting and reviewing employment contracts and code of conduct",
    "li3": "Employer-Employee dispute mediation",
    "li4": "Wrongful termination and dismissal",
    "li5": "Employee compensation for Injury",
    "li6": "Pension and Tax liabilities",
    "li7": "Health and Safety compliance"
  },
  {
    "id": 5,

    "image": "service6.png",
    "title": "Intellectual Property - Advisory, Registration, Management, etc:",
    "p1": "Intellectual assets are the fabric of innovation which forms the bedrock of socio-economic advancements. At Roothe-Kharis & Partners, we have developed a strategic and practical approach to protecting and maximizing the values of our Clients’ various intellectual property assets.",
    "p2": "We combine our expertise and knowledge of the corporate and regulatory frameworks in specific industry sectors to provide solutions tailored to our Client’s short and long-term needs. These services include:",
    "li1": "Trademark and Patent registration",
    "li2": "Portfolio protection",
    "li3": "Industrial Designs",
    "li4": "Registration renewals",
    "li5": "Litigation proceedings in opposition of registration",
    "li6": "Intellectual property transactions",
    "li7": "Dispute resolution",
    "li8": "Intellectual property consultation and general advisory"
  },
  {
    "id": 6,

    "image": "service7.png",
    "title": "Alternative Dispute Resolution Services",
    "p1": "At Roothe - Kharis & Partners, we understand that time is a valuable resource and we explore several alternatives in resolving disputes while focused on the interest and objectives of our Clients. We employ strategies beyond negotiation, litigation, mediation, conciliation and arbitration to minimize costs.s"
  },
  {
    "id": 7,

    "image": "service8.png",
    "title": "Technology & Digital Economy",
    "p1": "Roothe-Kharis bridges the gap between innovation and regulation, ensuring that our clients in the tech ecosystem operate with legal certainty while scaling in Nigeria/Africa. We combine local expertise with global best practices, particularly for Startups seeking compliant market entry, organizations adopting digital transformation, or Investors navigating high-growth tech sectors.",
    "p2": "Our Technology Practice Area includes the provision of comprehensive legal solutions such as Regulatory Compliance & Licensing, Intellectual Property (IP) Protection, structuring Contracts & Commercial Agreements, Dispute Resolution & Risk Management, and general legal advisory."
  }
]
