[
  {
    "image": "image1.jpg",
    "image2": "image2.jpg",
    "title": " The Extent of a Third Party Participation at a Company's Meeting",
    "text": " A board meeting is a formal gathering of the directors of a company to deliberate on company affairs and make strategic decisions.",
    "sections": [
      {
        "heading": "INTRODUCTION",
        "content1": "A board meeting is a formal gathering of the directors of a company to deliberate on company affairs and make strategic decisions. The primary attendees of a board meeting are the directors of the company. The Companies and Allied Matters Act, 2020 (CAMA 2020) governs the composition, rights, and procedures of board meetings in Nigeria. ",
        "content2": "The primary attendees of a board meeting are the directors of the company. According to Section 289(1) of CAMA 2020, every company is required to hold board meetings, and these meetings must be attended by the directors who are responsible for managing the company’s affairs. By the provisions of Section 335 of CAMA 2020 a company secretary has a right to attend board meeting because of their role in ensuring that the company compliances with applicable rules and regulations. Section 335 (2) CAMA 2020 provides that ‘’The secretary shall not, without the authority of the board exercise any power vested in the directors’’ this implies that the secretary does not have any power to make decisions at the board meeting.",
        "content3": "Occasionally, companies invite third parties, such as consultants, legal advisors, or auditors, to provide expert insights during board meetings. However, the extent to which such third parties can participate particularly whether they can move or adopt motions is subject to Corporate Governance principles and statutory regulations, primarily governed by CAMA 2020 and relevant corporate governance codes in Nigeria."
      },
      {
        "heading": "Legal Framework for Board Meetings in Nigeria",
        "content": "Section 305 CAMA 2020 stipulates that directors are responsible for the general management of a company’s business including the initiation and adoption of motions during board meetings. This responsibility is exclusive to directors and cannot be delegated to non-directors unless expressly provided in the company’s articles or through a valid board resolution. The directors in discharging their managerial duties can invite third parties as advisers or experts to provide guidance on technical matters, such as regulatory compliance, financial structuring, or strategic planning. However, their participation or role at the meeting remains advisory and not voting participation.",
        "content2": "The Nigerian Code of Corporate Governance (NCCG) 2018, issued by the Financial Reporting Council of Nigeria (FRCN) reinforces that while external professionals such as consultants may provide valuable advice and expertise during board meetings, they do not possess the statutory authority to make binding decisions or to propose and adopt motions during meetings. Their role is advisory, supporting the board’s decision-making process without substituting the directors’ responsibility.  "
      },
      {
        "heading": "Legal Implication of a Motion Moved/Adopted by a Third Party at a Company’s Board Meeting",
        "points": [
          {
            "title": "Lack of Legal Authority:",
            "description": "A third party not being a member of the board, lacks the legal authority to move or adopt motions. Any motion initiated by a such third party would not satisfy the procedural requirements laid down by CAMA 2020 and the company’s articles of association."
          },
          {
            "title": "Procedural Invalidity:",
            "description": "Since board decisions must be made solely by directors, a motion moved or adopted by a third party is procedurally flawed. In effect, any decision arising from such a motion would be considered invalid, as it does not reflect a proper exercise of the board’s power."
          },
          {
            "title": "Void or Voidable Decisions:",
            "description": "Where a board inadvertently allows a third party to interfere in the decision-making process during a meeting, such decision may be challenged on the grounds that it was adopted through an improper process. Courts or regulatory bodies may then deem the decision void or voidable, undermining its enforceability."
          },
          {
            "title": "Breach of Governance Protocols:",
            "description": "Permitting a third party to move or adopt a motion undermines the integrity of the board’s decision-making process. It may indicate a lapse in adherence to corporate governance best practices, potentially leading to internal disputes or conflicts of interest."
          }
        ]
      },
      {
        "heading": "Conclusion",
        "content": "Under Nigerian law, specifically the provisions of CAMA 2020 and the Nigerian Code of Corporate Governance, only directors are authorized to move and adopt motions during board meetings. A consultant or adviser as third parties do not have the legal capacity to do so. Any motion moved or adopted by a third party is legally invalid, and decisions based on such motions may be challenged and potentially nullified",
        "content2": "Companies must adhere strictly to their internal governance frameworks to ensure that decision-making authority remains solely with duly appointed directors, thereby safeguarding the company’s legal and operational integrity. While consultants or advisers may provide indispensable advice, it is imperative that their role remains advisory. Directors should ensure that all formal motions and resolutions are initiated, seconded, and adopted exclusively by the board, thereby upholding the provisions of CAMA and Corporate Governance."
      }
    ]
  }
]
