[
  {
    "image": "image1.jpg",
    "image2": "image2.jpg",
    "title": " The Extent of a Third Party Participation at a Company's Meeting",
    "text": " A board meeting is a formal gathering of the directors of a company to deliberate on company affairs and make strategic decisions.",
    "date":"19 Mar 2025",
    "sections": [
      {
        "heading": "INTRODUCTION",
        "content1": "A board meeting is a formal gathering of the directors of a company to deliberate on company affairs and make strategic decisions. The primary attendees of a board meeting are the directors of the company. The Companies and Allied Matters Act, 2020 (CAMA 2020) governs the composition, rights, and procedures of board meetings in Nigeria. ",
        "content2": "The primary attendees of a board meeting are the directors of the company. According to Section 289(1) of CAMA 2020, every company is required to hold board meetings, and these meetings must be attended by the directors who are responsible for managing the company’s affairs. By the provisions of Section 335 of CAMA 2020 a company secretary has a right to attend board meeting because of their role in ensuring that the company compliances with applicable rules and regulations. Section 335 (2) CAMA 2020 provides that ‘’The secretary shall not, without the authority of the board exercise any power vested in the directors’’ this implies that the secretary does not have any power to make decisions at the board meeting.",
        "content3": "Occasionally, companies invite third parties, such as consultants, legal advisors, or auditors, to provide expert insights during board meetings. However, the extent to which such third parties can participate particularly whether they can move or adopt motions is subject to Corporate Governance principles and statutory regulations, primarily governed by CAMA 2020 and relevant corporate governance codes in Nigeria."
      },
      {
        "heading": "Legal Framework for Board Meetings in Nigeria",
        "content": "Section 305 CAMA 2020 stipulates that directors are responsible for the general management of a company’s business including the initiation and adoption of motions during board meetings. This responsibility is exclusive to directors and cannot be delegated to non-directors unless expressly provided in the company’s articles or through a valid board resolution. The directors in discharging their managerial duties can invite third parties as advisers or experts to provide guidance on technical matters, such as regulatory compliance, financial structuring, or strategic planning. However, their participation or role at the meeting remains advisory and not voting participation.",
        "content2": "The Nigerian Code of Corporate Governance (NCCG) 2018, issued by the Financial Reporting Council of Nigeria (FRCN) reinforces that while external professionals such as consultants may provide valuable advice and expertise during board meetings, they do not possess the statutory authority to make binding decisions or to propose and adopt motions during meetings. Their role is advisory, supporting the board’s decision-making process without substituting the directors’ responsibility.  "
      },
      {
        "heading": "Legal Implication of a Motion Moved/Adopted by a Third Party at a Company’s Board Meeting",
        "points": [
          {
            "title": "Lack of Legal Authority:",
            "description": "A third party not being a member of the board, lacks the legal authority to move or adopt motions. Any motion initiated by a such third party would not satisfy the procedural requirements laid down by CAMA 2020 and the company’s articles of association."
          },
          {
            "title": "Procedural Invalidity:",
            "description": "Since board decisions must be made solely by directors, a motion moved or adopted by a third party is procedurally flawed. In effect, any decision arising from such a motion would be considered invalid, as it does not reflect a proper exercise of the board’s power."
          },
          {
            "title": "Void or Voidable Decisions:",
            "description": "Where a board inadvertently allows a third party to interfere in the decision-making process during a meeting, such decision may be challenged on the grounds that it was adopted through an improper process. Courts or regulatory bodies may then deem the decision void or voidable, undermining its enforceability."
          },
          {
            "title": "Breach of Governance Protocols:",
            "description": "Permitting a third party to move or adopt a motion undermines the integrity of the board’s decision-making process. It may indicate a lapse in adherence to corporate governance best practices, potentially leading to internal disputes or conflicts of interest."
          }
        ]
      },
      {
        "heading": "Conclusion",
        "content": "Under Nigerian law, specifically the provisions of CAMA 2020 and the Nigerian Code of Corporate Governance, only directors are authorized to move and adopt motions during board meetings. A consultant or adviser as third parties do not have the legal capacity to do so. Any motion moved or adopted by a third party is legally invalid, and decisions based on such motions may be challenged and potentially nullified",
        "content2": "Companies must adhere strictly to their internal governance frameworks to ensure that decision-making authority remains solely with duly appointed directors, thereby safeguarding the company’s legal and operational integrity. While consultants or advisers may provide indispensable advice, it is imperative that their role remains advisory. Directors should ensure that all formal motions and resolutions are initiated, seconded, and adopted exclusively by the board, thereby upholding the provisions of CAMA and Corporate Governance."
      }
    ]
  },
  {
    "image": "landlord.jpg",
    "image2": "landlord2.jpg",
    "title": " Understanding The New Tenancy Law Of Lagos State: What Landlords Need To Know",
    "text": "Landlords, property managers, and real estate investors play a critical role in the housing ecosystem of Lagos State.",
    "date":"26 Mar 2025",
    
      "content": "<!DOCTYPE html>\n<html lang=\"en\">\n<head>\n    <meta charset=\"UTF-8\">\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">\n    <span>1. Introduction:</span>\n<span>Landlords, property managers, and real estate investors play a critical role in the housing ecosystem of Lagos State. This critical role makes it essential to stay informed about the laws that govern the relationships between landlords, property managers, and tenants.</span>\n\n<span>The Lagos State Tenancy Law of 2011 is one of such recent but critical pieces of legislation that every landlord, property manager, or real estate investor should understand in order to operate successfully and avoid legal pitfalls.</span>\n\n<span>2. An Overview of the New Tenancy Law of Lagos State</span>\n<span>The Tenancy Law was enacted to regulate the relationship between landlords and tenants in Lagos State and provide the framework for the creation, operation, and termination of tenancy agreements while protecting the rights and obligations of the parties, and provides the procedure for the recovery of premises.</span>\n<span>The law applies to all commercial and residential premises within Lagos State (S. 1), excluding Apapa, Ikeja G.R.A., Ikoyi, and Victoria Island.</span>\n\n<span>3. The Rights and Responsibilities of Landlords under the Tenancy Law</span>\n<span>Who is a \"Tenant\" under the Tenancy Law?</span>\n<span>The law defines a tenant as any person who occupies any premises by the payment of rent, or by the operation of law NOT any person who unlawfully occupies under a bonafide claim to be the owner.</span>\n\n<span>Who is a \"Landlord\" under the Tenancy Law?</span>\n<span>The law defines a landlord as any person who receives any rent (whether in his own right or as an attorney or agent) from any person for the occupation of any premises in respect of which he has a right to receive such rent. A former landlord, an attorney, solicitor, agent, or caretaker of a landlord is also described as a landlord.</span>\n\n<span>4. The Creation of Tenancy</span>\n<span>By the definition of who a tenant is, we see that a tenancy is created by an agreement which is deemed to have been created where a landlord grants a person who pays value, the right to the use of his premises. Such an agreement can be made expressly or impliedly, orally, in writing, partly oral or partly written, or for a fixed period (e.g., shortlets, Airbnb, etc). According to this definition, a tenant can either be an individual or a business entity.</span>\n\n<span>5. What Landlords Must Know in Relation to Business Premises</span>\n<ul>\n    <li>A landlord should not:</li>\n    <li>Significantly prevent a tenant’s access to business premises.</li>\n    <li>Extensively obstruct the flow of customers, clients, or other persons using the tenant’s business premises.</li>\n    <li>Cause or fail to remove anything that may disturb a tenant’s trade within the business premises such that would amount to a loss of profit for the tenant.</li>\n    <li>Fail to rectify the breakdown of plant or equipment under his care or maintenance as soon as possible.</li>\n</ul>\n\n<span>6. Rent Control</span>\n<span>What does \"Rents\" mean under the Tenancy Law?</span>\n<span>What qualifies as rent includes any consideration or money paid or agreed to be paid or value or a right given or agreed to be given or part of any crop rendered or any equivalent given in kind or in labour, in consideration of which a landlord has permitted any person to use and occupy any land, premises, or other corporeal hereditament, and the use of common areas but does not include any charge for services or facilities provided in addition for the occupation of the premises.</span>\n\n<span>It is a criminal offence for a landlord to:</span>\n<ul>\n    <li>demand or receive from an existing monthly tenant, six (6) months’ rent in advance.</li>\n    <li>demand or receive from an existing yearly tenant, one (1) year rent in advance.</li>\n    <li>demand or receive from a new or proposed tenant, one (1) year in advance.</li>\n</ul>\n\n<span>A landlord who demands rent in advance will be guilty of an offence and liable to 100,000 fine or three (3) months imprisonment.</span>\n\n<span>7. Rent Increment: Rights of a Tenant and How They Affect Landlords</span>\n<span>Often asked questions: what happens in a situation where after the landlord has increased rent, the tenant refused to pay the increased rent?</span>\n<span>An existing tenant can apply to the court for an order declaring that the increase in rent under the tenancy agreement is unreasonable. The court will then consider the following:</span>\n<ul>\n    <li>The rent payable in the same locality generally.</li>\n    <li>Evidence of the landlord and the tenant.</li>\n    <li>Special circumstances necessitating the increase in rent e.g., a new amenity has been included, etc.</li>\n</ul>\n\n<span>The tenant can apply to the court to pay the current rent to the court’s registry. The landlord will then be required to approach the court to receive the rent but a sum amounting to 10% of the rent will be deducted by the court before handing over the rent to the landlord.</span>\n\n<span>In <em>JOVINCO NIGERIA LTD & ANOR V. IBEOZIMAKO (2014) LPELR-23599(CA)</em>, the court held that a landlord cannot unilaterally increase rent. An increment in rent must be supported by an agreement – since the landlord and tenancy relationship is a contractual relationship.</span>\n\n<span>In <em>COBRA LTD V. OMOLE ESTATE AND INVESTMENT LTD (2000) 1 NWLR (Pt. 655)</em>, the court held that unless there is an agreement between the landlord and the tenant, a landlord’s unilateral decision to increase rent is ineffective. See also, <em>UDIHI V. IZEDOMWEN (1990) 2 NWLR (Pt. 132), 357 at 366</em>.</span>\n\n<span>In a more recent case of <em>CHISCO TRANSPORT (NIG) LTD V. NJOKU & ORS (2024) LPELR-62333 (CA)</em>, the court held that a landlord does not possess the power to unilaterally increase rent. The matter of rent increment must be supported by an agreement to that effect.</span>\n\n<span>8. Rights of a Landlord</span>\n<ul>\n    <li>Right to obtain a court order to re-enter and end the tenancy if the tenant breaches any covenants of the tenancy agreement.</li>\n    <li>Right to apply for court order for possession on the grounds that the premises is being used for immoral or illegal purposes, the premises has been abandoned, the premises is unsafe and unsound as to constitute a danger to human life or property, an act of intolerable nuisance by the tenant such that induces a breach of the tenancy agreement.</li>\n    <li>Right to recover the premises where a fixed tenancy has ended.</li>\n    <li>The 7 days notice of Owner’s intention to recover possession has been served on the tenant.</li>\n</ul>\n\n<span>9. Landlords Obligations</span>\n<ul>\n    <li>Issue payment receipt to tenants for the payment of rent. A landlord who fails to issue a rent payment receipt is guilty of an offence and liable to pay a fine of N100,000.</li>\n    <li>Issue a separate receipt for the payment of security deposit to cover damages and repairs to the premises, services and facilities, service charge.</li>\n    <li>Not to disturb the tenant's quiet and peaceable enjoyment of the premises. Peace and quiet enjoyment include the tenant’s right to privacy, freedom from unreasonable disturbance, exclusive possession of the premises, right to common areas for reasonable and lawful purpose.</li>\n    <li>Pay all rates and charges as stipulated by law e.g., land use charge, LAWMA, etc.</li>\n    <li>Keep the premises insured against loss or damage e.g., providing security.</li>\n    <li>Not terminate or restrict the use of a common facility or service for the use of the premises.</li>\n    <li>Not seize any item or property of the tenant or interfere with the tenant's access to his personal property.</li>\n    <li>Effect repairs and maintain the external and common parts of the premises.</li>\n</ul>\n\n<span>10. How a Tenancy is Terminated</span>\n<ul>\n    <li>By notice to quit:</li>\n    <ul>\n        <li>One week’s notice for a tenant at will.</li>\n        <li>One (1) month’s notice for a monthly tenant.</li>\n        <li>Three (3) months’ notice for a quarterly tenant.</li>\n        <li>Three (3) months’ notice for a half-yearly tenant.</li>\n        <li>Six months’ notice for a yearly tenant.</li>\n        <li>Tenancy for a fixed term: at the end of the tenancy/7 days notice of owner’s intention to recover possession.</li>\n        <li>Licensees are entitled to a 7 days notice of owner's intention to apply to recover possession.</li>\n    </ul>\n    <li>By court order</li>\n</ul>\n\n<span>11. Illegal/Unlawful Ways to Terminate a Tenancy</span>\n<ul>\n    <li>By harassment – wilfully removing the roof of the building, disconnecting electricity supply or water supply.</li>\n    <li>Forcefully ejecting a tenant while an action is pending in court against the increment of rent.</li>\n    <li>Threatening or molesting a tenant by action or words.</li>\n</ul>\n\n<span>These actions are illegal and unlawful and carry liability in law. A landlord who commits any of these illegal acts is guilty of an offence and liable to a fine not exceeding N250,000 or a maximum of six (6) months imprisonment.</span>\n\n<span>12. General Limitations a Landlord Should Be Aware Of</span>\n<ul>\n    <li>Rent advance limitation</li>\n    <li>Eviction limitation – i.e., without following legal procedures.</li>\n    <li>Rent review limitations</li>\n</ul>\n\n<span>13. Strategies for Mitigating These Limitations</span>\n<ul>\n    <li>Landlords should conduct thorough tenant screening to reduce default risks.</li>\n    <li>Drafting airtight tenancy agreements that clarify all obligations.</li>\n    <li>Ensure compliance with statutory notices for eviction and rent increases.</li>\n    <li>Immediately take legal action when tenants default to minimize delays.</li>\n</ul>\n\n<span>14. Resolving Disputes Under the Law</span>\n<span>The Tenancy Law promotes alternative ways of amicably resolving disputes between a landlord and tenant such as reconciliation and mediation. However, the court can refer a tenancy dispute to mediation (at the Citizen Mediation Centre or to the Lagos Multi-Door Court House) without the consent of the landlord and the tenant (S. 32).</span>\n<span>An agreement known as a mediation agreement is typically executed at the end of mediation and enforced by the court.</span>\n\n<span>15. Conclusion</span>\n<span>The Tenancy Law of Lagos State 2011 is a comprehensive legal framework designed to balance the interests of landlords and tenants while promoting fairness and stability in the rental market. It emphasizes the importance of written agreements, proper notice periods, and due process in resolving disputes. Both landlords and tenants are encouraged to familiarize themselves with the Law to ensure compliance and avoid legal pitfalls.</span>\n\n<span>At Roothe-Kharis, we specialize in guiding both landlords and tenants through the complexities of laws and regulations, ensuring compliance and minimizing legal risks. Whether you are a property owner seeking to protect your investment or a tenant aiming to understand your rights, our expert team is here to provide tailored solutions and unparalleled support.</span>\n\n<span>Do not hesitate to contact us if you have any questions or require further clarifications on this article. Let us help you unlock the full potential of your property or tenancy experience with confidence and peace of mind.</span>\n\n</body>\n</html>"
    
    
    },

  {
    "image": "estate.jpg",
    "image2": "estate2.jpg",
    "title": "  Legal Considerations In Real Estate Investment And Development In Nigeria",
    "text": " In Nigeria, real estate investment and development is widely recognized as a profitable and stable venture, offering long-term financial benefits. ",
    "date":"26 Mar 2025",
    
      "content": "<html><head></head><body><span>Introduction</span><span>In Nigeria, real estate investment and development is widely recognized as a profitable and stable venture, offering long-term financial benefits. However, the acquisition and development of real property are subject to complex legal and regulatory frameworks that must be carefully navigated to ensure compliance and mitigate risks. Failure to adhere to these legal requirements may result in financial losses, disputes, or regulatory sanctions.</span><span>This article examines some key legal considerations in real estate investment and development in Nigeria, focusing on the legal framework for real estate investment and development, the verification of title, contractual obligations, and conflict resolution mechanisms.</span><span>As an investment asset, the tangible characteristic of real estate provides a sense of investment security unlike stocks and bonds. Regardless of market fluctuations, property value generally increases over time, making real estate an attractive long-term investment. Furthermore, the development of commercial and residential properties can provide an excellent passive income through lease payments, when properly managed.</span><span>In relation to development, a piece of real estate (for example, a bare land) can be developed for residential or commercial use by improving its physical aesthetics or such improvements that may enhance its value, or for a future sale.</span><span>1. Right to the ownership of real estate in Nigeria</span><span>The Constitution of the Federal Republic of Nigeria, 1999 (as amended) provides that '…every citizen of Nigeria shall have the right to acquire and own immovable property anywhere in Nigeria.' This forms the bedrock of the legal rights to the ownership of real estate (as an immovable) property in Nigeria.</span><span>Historically, the original ownership of real estate arose by either one of the following: deforestation/first settlement of a virgin land, conquest during inter-tribal wars, etc. In recent years, the ownership of real estate may devolve by a sale or purchase, or by inheritance through a clear and uncontroverted traditional history, or by gift, or by a customary grant, etc.</span><span>In rural areas, Customary right in the ownership of land is still practised in Nigeria wherein only a community, a village, or a family can exercise ownership to land or real estate – not an individual. In order for the sale or purchase of community land to be valid, several requirements must be fulfilled including the payment of a purchase price, the delivery of possession, and the presence of witnesses.</span><span>However, ownership of land in urban areas is subject to the Land Use Act 1978 which provides that '…all lands in urban areas shall be under the control and management of the Governor of each state…'.</span><span>2. The verification of title</span><span>The verification of an interest or title to a piece of real estate involves practical and procedural steps taken to confirm the legal ownership, validity, and enforceability of the claimed interest or title. This process typically includes:</span><ul><li>Reviewing the title documents,</li><li>Conducting due diligence,</li><li>Verifying encumbrances,</li><li>Checking compliance with regulatory requirements,</li><li>Ensuring there are no pre-existing disputes or defects that could affect the property’s marketability or transferability.</li></ul><span>In EFCC & ANOR V. IBRAHIM, Justice Peter Chudi Obiorah noted that 'it is not in the pages of newspapers that encumbrances on landed properties are registered.'</span><span>Title to a piece of real estate can be verified by traditional history/evidence, by duly authenticated and verified documents, by acts of ownership, by proof of possession of a connected land, and by sufficient acts of possession over a long period of time.</span><span>3. Foreign investment restrictions</span><span>In a plethora of decided cases, the Courts have held that the application of the Land Use Act 1978 is wholly for the benefit of Nigerians. However, a foreigner seeking to invest in Nigeria may do so subject to the provisions of the Nigerian Investment Promotion Commission Act, the Companies and Allied Matters Act, 2020, and under the close monitoring of the Foreign Exchange (Monitoring & Miscellaneous Provisions) Act amongst other applicable laws.</span><span>4. Compliance with zoning regulations</span><span>In Nigeria, land zoning and planning are governed by a combination of federal, state, and local government regulations. Zoning involves the systematic division of land into distinct zones based on designated purposes such as residential, agricultural, commercial, industrial, or recreational uses. Land zoning is aimed at optimizing land use, promoting orderly development, ensuring efficient resource allocation, and fostering sustainable and well-structured communities.</span><span>Non-compliance with zoning laws may result in regulatory sanctions, demolition orders, or avoidable legal disputes. In 2024, several buildings were demolished in Lagos State due to non-compliance with the Lagos State Urban and Regional Planning and Development (Amendment) Law 2019.</span><span>5. Taxation</span><span>It is important to note that investing in real estate attracts several taxes including capital gains tax charged at a flat rate of 10% on the profit from the sale of a property, stamp duty tax charged ad-valorem on the documents of transfer and varies according to each state law and the document type, others are company income tax, and personal income tax.</span><span>6. Conflict resolution mechanisms</span><span>Conflict may arise at any time within real estate investment and development cycle from land ownership and title disputes, breach of contract, regulatory non-compliance, opposition from the community, the list is endless. Effective conflict resolution mechanisms are crucial to maintaining investor confidence, ensuring project continuity, and a stable real estate market.</span><span>In Nigeria, real estate conflicts are governed by the Land Use Act 1978, the Urban and Regional Planning Act, contract law, state laws, the civil procedure rules of each state, other relevant laws, regulations, and policies.</span><span>Depending on the nature of the conflict, resolution may be pursued in court through litigation, or through alternatives such as negotiation, mediation, arbitration, or regulatory intervention.</span><span>BEST PRACTICES FOR PREVENTING CONFLICT IN REAL ESTATE TRANSACTIONS</span><span>At Roothe-Kharis & Partners, we understand that real estate investment and development require a strategic approach that balances legal compliance, commercial viability, and risk management. With extensive expertise in real estate transactions, Roothe-Kharis provides tailored legal solutions that support clients throughout the entire property lifecycle - from acquisition and financing to development, management, and exit strategies.</span><span>Our team is well versed in land title verification, joint venture structuring, project financing, zoning and planning regulations, conflict prevention and resolution mechanisms.</span><span>In line with our commitment to delivering end-to-end legal solutions, we highlight below key practices to ensure that stakeholders operate with legal certainty and commercial confidence:</span><ul><li>Early consultation with experts: engaging legal, financial, and technical experts at the outset of a real estate transaction or development project would help identify and mitigate potential risks before they escalate. Early legal intervention ensures proper structuring, regulatory compliance and due diligence.</li><li>Comprehensive due diligence: investors and developments must conduct thorough title verification, regulatory compliance checks, and community engagements before acquiring real estate.</li><li>Well-structured contracts: whether advising institutional investors, developers, financiers, or private clients, clearly drafted agreements, including dispute resolution clauses, help prevent ambiguities that may lead to conflicts.</li><li>Stakeholder engagements: proactive consultation with government agencies, host communities, and regulatory bodies can mitigate disputes.</li><li>ADR mechanisms: considering the time and cost implications of litigation, ADR mechanisms should be deployed at the earliest possible signs of a conflict.</li></ul><span>CONCLUSION</span><span>Navigating the legal landscape of real estate investment and development in Nigeria requires a thorough understanding of the regulatory framework, compliance requirements, and risk mitigation strategies. From land acquisition and title verification to zoning laws and contractual agreements, investors must be well-informed to avoid legal pitfalls and ensure profitable ventures.</span><span>Engaging experienced legal professionals is crucial to safeguarding investments and achieving long-term success in this dynamic sector. Our deep expertise in real estate law makes us well-versed in providing comprehensive advisory and legal services tailored to the unique needs of our clients. By partnering with Roothe-Kharis, investors can confidently make informed decisions, minimize risks, and maximize the potential of their real estate investments in Nigeria.</span><span>Do not hesitate to contact us if you are seeking to explore new opportunities or expand your investment portfolios. Roothe-Kharis offers personalized legal solutions and strategic insights to help clients unlock growth and achieve their business objectives in Nigeria’s thriving real estate market.</span></body></html>"
    
    
  

},
{
  "image": "deed.jpg",
  "image2": "deed2.jpg",
  "title": " Understanding The Deed Of Assent: Transferring Legal Title To Beneficiaries Under a Will",
  "text": " A Deed of Assent is an instrument or legal document that comes into existence in furtherance of the devolution of title to real property to beneficiaries under a Will",
  "date":"26 Mar 2025",
    "content": "<span>Introduction</span>\n<p>A Deed of Assent is an instrument or legal document that comes into existence in furtherance of \nthe devolution of title to real property to beneficiaries under a Will. It is important to state that a \nwill in itself cannot confer title or ownership on a beneficiary, it only accords a named beneficiary \nan equitable interest in the property gifted to him while a deed of assent accords a legal title or \nownership to the property. A named beneficiary in a Will cannot assume legal title or ownership \nof any property gifted to him until a deed of assent has been executed in his favour.</p>\n\n<p>A deed of assent serves the purpose of conferring legal ownership of a gift in a Will on the named \nbeneficiaries or a third party by Executors or Administrators of an estate. Where a deed of assent \nhas been duly executed in favour of the beneficiaries, a third party cannot subsequently lay claims \nto the properties that have been duly passed on to the intended beneficiaries.</p>\n\n<p>Section 40 of the Administration of Estate Law of Lagos State provides for the effect of assent by \nthe personal representative. It states that “a personal representative may assent to the vesting in any \nperson who either by devise, bequest, devolution, appropriation or otherwise, may be entitled to, either \nbeneficiary or as a trustee or personal representative, of any estate or interest in real estate to which the \ntestator or intestate was entitled or over which he exercised a general power of appointment by his will \nand which devolved upon the personal representative.”</p>\n\n<span>Conditions for a Valid Assent</span>\n<ul>\n<li>An assent to the vesting of a legal estate shall be in writing.</li>\n<li>It shall be signed by the personal representative.</li>\n<li>It shall name the person in whose favour it is given.</li>\n<li>It shall operate to vest in that person the legal estate to which it relates.</li>\n<li>An assent not in writing or not in favour of a named person shall not be effectual to \npass a legal estate.</li>\n</ul>\n\n<span>Checklist of the Requirements for Registration</span>\n<ul>\n<li>An application letter addressed to the Registrar of Titles requesting to register a deed \nof assent with a functional phone number and email address.</li>\n<li>Two copies of the Deed of Assent/ Vesting Deed.</li>\n<li>Deed must be dated, signed, and each page initialed.</li>\n<li>Passport photographs of all the administrators/executors to be attached to the deed.</li>\n<li>The front cover of the deed must be signed and sealed by the solicitor who prepared \nthe deed.</li>\n<li>Spiral/bookbinding.</li>\n<li>A certified true copy of the root of title.</li>\n<li>A certified true copy of the letter of administration/ Will.</li>\n<li>A sworn affidavit deposed to by the administrators/executors attesting to the vesting.</li>\n<li>Original for sighting and one copy of the valid means of identification of all the \nadministrators/executors.</li>\n<li>Payment receipt.</li>\n</ul>\n\n<span>Conclusion</span>\n<p>A Deed of Assent is so important in the devolution of the estate of the deceased. The title in a \nproperty cannot pass to the intended named beneficiary or any third party without a duly \nexecuted deed of assent, which must be signed by the Executors or Administrators to the Will. \nAnd as earlier stated, once it has fulfilled the conditions highlighted above, a third party cannot \nlay claims to the properties of the deceased already passed on to the beneficiaries.</p>\n\n<p>Roothe-Kharis is a team of lawyers well versed in drafting legal contracts, wills and codicils. Do not hesitate to\ncontact us if you have any questions or require further clarifications on this article. We are available to provide \nthe support you need in navigating and distilling the fine prints of a testamentary document.</p>\n"



}
]
