[
  {
    "link": "the-extent-of-a-third-party-participation-at-a-companys-meeting/",
    "image": "image1.jpg",
    "image2": "image2.jpg",
    "title": " The Role of a Third Party in a Company’s Board Meeting in Nigeria ",
    "text": "It’s no news how rapidly the business environment is growing these days, and board meetings play an important role in shaping the direction of a company's growth. They serve as the major gathering for strategic decisions, evaluating performance, and ensuring the company is on track to meet its overall goal.", 
    "date": "13 June 2025",

    "content": "<body><h1>The Role of a Third Party in a Company’s Board Meeting in Nigeria</h1><div class=\"section\"><h3>Introduction</h3><p>It’s no news how rapidly the business environment is growing these days, and board meetings play an important role in shaping the direction of a company's growth. They serve as the major gathering for strategic decisions, evaluating performance, and ensuring the company is on track to meet its overall goal.</p><p>However, as businesses become more complex, third-party professionals, such as legal advisors, auditors, and company secretaries, are increasingly invited to attend these meetings. But how much power and influence can these third parties have in a board meeting? Can they speak freely, make suggestions, or even propose a decision?</p><p>The answer depends on a clear understanding of the Companies and Allied Matters Act (CAMA) 2020, as well as best practices in corporate governance. In this article, we explain to you what the law says about third-party participation at board meetings, what the limits are, and how Roothe-Kharis helps businesses navigate these legal grey areas with confidence.</p></div><div class=\"section\"><h3>What Is a Board Meeting?</h3><p>A board meeting is a formal gathering of the directors of a company to deliberate on company affairs and make strategic decisions. The primary attendees of a board meeting are the directors of the company. These meetings are legally required under the Companies and Allied Matters Act (CAMA) 2020, which governs companies operation in Nigeria.</p><p>By law, the primary attendees at a board meeting are the directors. However, other professionals, such as:</p><ul><li>Legal advisors or external counsel</li><li>Company secretaries</li><li>Auditors or financial consultants</li><li>Tax advisors</li><li>Regulatory compliance</li></ul></div><div class=\"section\"><h3>What Does the Law Say About Board Meetings?</h3><p>According to Section 289 (1) of CAMA 2020, every company in Nigeria is obligated to hold board meetings, and these meetings must be attended by the directors, who are in charge of running the company.</p><p>The company secretary, as stated in Section 335 of CAMA 2020, has the right to attend these meetings, but cannot make decisions or act in place of the board without permission from the directors. Their role is to ensure compliance with laws, keep records, and support smooth governance processes.</p><p>Occasionally, companies invite company secretarial services to provide expert insights during board meetings. However, the extent to which such third parties can participate, particularly whether they can move or adopt motions, is subject to corporate governance principles and statutory regulations, primarily governed by CAMA 2020 and relevant corporate governance codes in Nigeria.</p></div><div class=\"section\"><h3>Legal Implications of Unauthorized Third-Party Participation</h3><p>These limits are reinforced in Section 305 of CAMA 2020 and the Nigerian Code of Corporate Governance (NCCG) 2018, which stress that only directors have the legal authority to make decisions at board meetings.</p><p>If a third party tries to move or adopt a motion during a board meeting, it could lead to serious consequences:</p><ol><li><strong>Lack of Legal Authority:</strong> A third party not being a member of the board lacks the legal authority to move or adopt motions. Any motion initiated by such a third party would not satisfy the procedural requirements laid down by CAMA 2020 and the company’s articles of association. Only directors are authorized to initiate motions. Any motion from a non-director has no legal standing.</li><li><strong>Procedural Invalidity:</strong> Since board decisions must be made solely by directors, a motion moved or adopted by a third party is procedurally flawed. In effect, any decision arising from such a motion would be considered invalid, as it does not reflect a proper exercise of the board’s power.</li><li><strong>Void or Voidable Decisions:</strong> Where a board inadvertently allows a third party to interfere in the decision-making process during a meeting, such a decision may be challenged on the grounds that it was adopted through an improper process. Courts or regulatory bodies may then deem the decision void or voidable, undermining its enforceability.</li><li><strong>Breach of Governance Protocols:</strong> Permitting a third party to move or adopt a motion undermines the integrity of the board’s decision-making process. It may indicate a lapse in adherence to corporate governance best practices, potentially leading to internal disputes or conflicts of interest.</li></ol></div><div class=\"section\"><h3>How Roothe-Kharis Supports Your Board Meetings</h3><p>At Roothe-Kharis, we understand the dynamics and frameworks of laws and how policies and regulations are continually evolving. That’s why we are here to help you stay compliant and avoid legal pitfalls by offering expert:</p><ul><li><strong>Company Secretarial Services:</strong> We ensure your meetings and records meet regulatory standards.</li><li><strong>Legal Advisory for Board Meetings:</strong> We provide you with clear and actionable guidance on complex legal matters.</li><li><strong>Corporate Governance Support:</strong> We help directors fulfill their duties without risking non-compliance.</li></ul><p>Our goal is to keep third-party involvement useful but within limits, so your board maintains its authority and every decision is legally valid.</p></div><div class=\"section\"><h3>Conclusion</h3><p>Only directors can make decisions at a board meeting. While third parties like legal advisors and company secretaries can attend and contribute insights, their role is strictly advisory. Any attempt to move or adopt motions by non-directors could render board decisions invalid.</p><p>Companies must adhere strictly to their internal governance frameworks to ensure that decision-making authority remains solely with duly appointed directors, thereby safeguarding the company’s legal and operational integrity.</p><p class=\"footer\">By understanding these boundaries and working with experienced professionals like Roothe-Kharis, your company can avoid governance errors and make sound, compliant decisions.</p></div></body></html>"
  },
  {
    "link": "understanding-the-new-tenancy-law-of-lagos-state-what-landlords-need-to-know/",
    "image": "landlord.jpg",
    "image2": "landlord2.jpg",
    "title": " Understanding The New Tenancy Law Of Lagos State: What Landlords Need To Know",
    "text": "Navigating property rental in Lagos can be challenging for landlords, especially when legal obligations and tenant rights come into play.",
    "date": "12 June 2025",

    "content": "<body><h1>Understanding the New Tenancy Law of Lagos State: What Landlords Need to Know</h1><div class=\"section\"><h3>Introduction</h3><p>Navigating property rental in Lagos can be challenging for landlords, especially when legal obligations and tenant rights come into play. With the Lagos State Tenancy Law of 2011 still in effect, landlords, property managers, and real estate investors need to understand their responsibilities and rights to avoid legal pitfalls and ensure smooth property management.</p><p>In this guide, we break down key provisions of the Lagos Tenancy Law, highlight landlord obligations, tenant rights, legal remedies, and practical steps for risk management, positioning you to handle tenancy matters confidently and lawfully.</p></div><div class=\"section\"><h3>What is the Lagos State Tenancy Law?</h3><p>The Lagos State Tenancy Law of 2011 was enacted to regulate the relationship between landlords and tenants across residential and commercial properties. It covers tenancy creation, rent control, dispute resolution, and lawful eviction procedures. The law is applicable in all parts of Lagos except highbrow areas like Ikoyi, Victoria Island, Ikeja GRA, and Apapa.</p><p>Under the law:</p><ul><li>A tenant is any individual or business entity occupying premises with the payment of rent or by the operation of law. NOT any person who unlawfully occupies under a bona fide claim to be the owner.</li><li>A landlord is anyone receiving rent from any person for the occupation of any premises in respect of which he has a right to receive such rent. Whether as an owner, an attorney, a solicitor, an agent, or a caretaker.</li></ul></div><div class=\"section\"><h3>Creating a Tenancy Agreement Under the Law</h3><p>A tenancy agreement is created when a landlord grants a person or business the right to occupy a property in exchange for payment. This agreement can be:</p><ul><li>Oral or written</li><li>Expressed or implied</li><li>Fixed-term or periodic (monthly, yearly)</li></ul><p>Landlords must ensure that tenancy agreements are clear, fair, and ideally documented to protect their interests.</p></div><div class=\"section\"><h3>Landlord Responsibilities Under the Tenancy Law</h3><p>Being able to comply with the law and maintain a good landlord-tenant relationship with your tenant is very important. To do that, landlords must:</p><ul><li>Issue a payment receipt to tenants for the payment of rent. A landlord who fails to issue a rent payment receipt is guilty of an offence and liable to pay a fine of N100,000. Issue a separate receipt for the payment of the security deposit to cover damages and repairs to the premises, services and facilities, and service charge.</li><li>Avoid disturbing the tenant's quiet and peaceable enjoyment of the premises. Peace and quiet enjoyment include the tenant’s right to privacy, freedom from unreasonable disturbance, exclusive possession of the premises, right to common areas for reasonable and lawful purposes.</li><li>Pay all rates and charges as stipulated by law, like land use charge, LAWMA charge, etc.</li><li>Keep the premises insured against loss or damage, e.g, by providing maximum security for the safety of your tenants.</li><li>Terminating or restricting the use of a common facility or service for the use of the premises.</li><li>Not seize any item or property of the tenant or interfere with the tenant's access to his personal property.</li><li>As a landlord, you are to effectively repair and maintain the external and general parts of the premises.</li><li>Ensure facilities like electricity and water are functional and not arbitrarily cut off. Which can lead to tenants getting frustrated.</li></ul></div><div class=\"section\"><h3>Rent Control and Advance Payment Under the Tenancy Law</h3><p>What qualifies as rent includes money paid or agreed to be paid, value given or agreed to be given, any equivalent given in kind or labour, in consideration of which a landlord has permitted any person to use and occupy any land, premises, or other corporeal heritament.</p><p>The use of common areas does not include any charge for services or facilities provided in addition to the occupation of the premises. It is a criminal offence for a landlord to request:</p><ul><li>Demand or receive from an existing monthly tenant six (6) months’ rent in advance.</li><li>Demand or receive from an existing yearly tenant, one (1) year's rent in advance.</li><li>Demand or receive from a new or proposed tenant, one (1) year in advance.</li></ul><p>Any landlord who is caught or reported violating these provisions can attract a ₦100,000 fine or up to 3 months' imprisonment.</p></div><div class=\"section\"><h3>Rent Increment Rules: What Tenants Must Know</h3><p>The rent increment must be mutually agreed upon. A landlord cannot unilaterally increase rent. In a situation where, after the landlord has increased rent, the tenant refuses to pay the increased rent, the tenant can challenge the increment in court, and the court will:</p><ul><li>Compare rent in similar locations</li><li>Consider the landlord's reasons (e.g., added amenities)</li><li>Allow the tenant to pay rent into court until the matter is resolved</li></ul><p>Cases like CHISCO TRANSPORT (NIG) LTD V. NJOKU (2024) reinforce this principle, making it clear that all increments must be backed by written agreements. Since the landlord and tenancy relationship is a contractual relationship.</p><p>In COBRA LTD V. OMOLE ESTATE AND INVESTMENT LTD (2000) 1 NWLR (Pt. 655), the court held that unless there is an agreement between the landlord and the tenant, a landlord’s unilateral decision to increase rent is ineffective.</p><p>In a more recent case of CHISCO TRANSPORT (NIG) LTD V. NJOKU & ORS (2024) LPELR-62333 (CA), the court held that a landlord does not possess the power to unilaterally increase rent. The matter of rent increment must be supported by an agreement to that effect.</p></div><div class=\"section\"><h3>Grounds for Landlords to Reclaim Properties</h3><p>Landlords can recover possession if:</p><ul><li>Right to obtain a court order to re-enter and end the tenancy if the tenant breaches any covenants of the tenancy agreement;</li><li>Right to apply for court order for possession on the grounds that the premises is being used for immoral or illegal purposes, the premises has been abandoned, the premises is unsafe and unsound as to constitute a danger to human life or property, an act of intolerable nuisance by the tenant such that induces a breach of the tenancy agreement.</li><li>Right to recover the premises where a fixed tenancy has ended</li><li>The 7-day notice of the Owner’s intention to recover possession has been served on the tenant.</li></ul><p>However, any eviction must follow due process. Using harassment, cutting off utilities, or intimidation is illegal and punishable by ₦250,000 fine or 6 months in jail.</p></div><div class=\"section\"><h3>Notice Periods for Tenancy Eviction</h3><p>Eviction notices vary by tenancy type:</p><ul><li>1 week: Tenancy at will</li><li>1 month: Monthly tenants</li><li>3 months: Quarterly or half-yearly tenants</li><li>6 months: Yearly tenants</li><li>7 days: Fixed-term tenancies after expiration</li></ul><p>All notices must be served from the date rent was paid and must comply with legal timelines to be valid in court.</p></div><div class=\"section\"><h3>Risk Management for Landlords</h3><p>To mitigate potential disputes and financial losses, landlords should:</p><ul><li>Conduct thorough tenant screening to reduce default risks.</li><li>Draft detailed tenancy agreements with clear terms</li><li>Comply with all notice requirements and rent review timelines</li><li>Seek legal help early when tenants default or issues arise</li></ul></div><div class=\"section\"><h3>Legal Dispute Resolution Under the Tenancy Law</h3><p>The tenancy law encourages landlords and tenants to use mediation or reconciliation as the first approach when dealing with dispute resolution. Without the consent of the landlord and the tenant, the court has the right to refer tenancy disputes to legal bodies like the Citizen Mediation Centre or the Lagos Multi-Door Courthouse.</p><p>Where mediation is successful, a mediation agreement is signed and enforced as a court judgment, saving time and litigation costs.</p></div><div class=\"section\"><h3>Conclusion</h3><p>The Lagos State Tenancy Law of 2011 serves as a comprehensive guide for lawful, respectful, and structured rental relationships. For landlords, it is not just about collecting rent, it is about protecting your investment while complying with the law.</p><p>By understanding the legal landscape, issuing proper notices, maintaining the premises, and respecting tenant rights, landlords can avoid costly disputes and operate more confidently in the Lagos property market.</p><p class=\"footer\">At Roothe-Kharis, we specialize in landlord-tenant legal advisory, helping real estate investors, property managers, and landlords navigate the complexities of Lagos tenancy laws. Whether you need help drafting airtight agreements, handling disputes, or recovering rent legally, our expert legal team is here to support you.</p></div></body></html>"
  },

  {
    "link": "legal-considerations-in-real-estate-investment-and-development-in-nigeria/",
    "image": "estate.jpg",
    "image2": "estate2.jpg",
    "title": "  Legal Considerations In Real Estate Investment And Development In Nigeria",
    "text": " Real estate investment and development in Nigeria has remained one of the most stable and lucrative ventures, offering long-term financial security for potential investors.",
    "date": "12 June 2025",

    "content": "<body><h1>Legal Considerations in Real Estate Investment and Development in Nigeria</h1><div class=\"section\"><h3>Introduction</h3><p>Real estate investment and development in Nigeria has remained one of the most stable and lucrative ventures, offering long-term financial security for potential investors. However, complex legal and regulatory issues can undermine this profitability. To ensure a smooth process and avoid legal pitfalls, investors must understand the relevant legal framework governing real estate in Nigeria.</p><p>As an investment asset, the tangible characteristic of real estate provides a sense of investment security unlike stocks and bonds, regardless of market fluctuations. Property value generally increases over time, making real estate an attractive long-term investment. The development of commercial and residential properties can also provide an excellent passive income through lease payments, when properly managed.</p><p>In relation to development, a piece of real estate, like land, can be developed for residential or commercial use by improving its physical aesthetics or such improvements that may enhance its value or for a future sale. This article outlines the major legal considerations in real estate investment and development in Nigeria, ranging from land ownership rights and title verification to zoning regulations, taxation, and conflict resolution.</p></div><div class=\"section\"><h3>The Right to Ownership of Real Estate in Nigeria</h3><p>The right to own immovable property is stated in Section 43 of the 1999 Constitution of the Federal Republic of Nigeria (as amended) that “...every citizen of Nigeria shall have the right to acquire and own immovable property anywhere in Nigeria.” This constitutional right allows every Nigerian citizen to acquire and own land anywhere in the country. Ownership of real estate may arise through:</p><ul><li>Historical settlement or conquest</li><li>Purchase or sale</li><li>Inheritance or traditional title</li><li>Customary grants or gifts</li></ul><p>In rural areas, lands are typically held under customary law, in the ownership of land is still practised in Nigeria, where only a community, a village, or a family can exercise ownership of land or real estate, not an individual. For a valid sale, you must meet certain conditions such as:</p><ul><li>Payment of purchase price</li><li>Delivery of possession</li><li>Presence of community or family witnesses</li></ul><p>In urban areas, the Land Use Act of 1978 governs ownership. According to Section 2, “all lands in urban areas are vested in the Governor of each State,” who holds and allocates land in trust.</p></div><div class=\"section\"><h3>Title Verification and Due Diligence</h3><p>In Nigeria, many people have witnessed countless cases of land fraud, double sales, and ownership disputes. Title verification isn't just a legal formality, it's a financial lifesaver. Before acquiring property, conducting thorough title verification is essential to confirm legal ownership and avoid disputes.</p><p>It’s advisable that investors verify that the person or entity selling the land has the legal right to do so. This includes checking the Land Registry, reviewing the Survey Plan, and ensuring there are no encumbrances such as mortgages or legal disputes. The process involves:</p><ul><li>Examining original title documents</li><li>Checking for encumbrances</li><li>Confirming regulatory approvals</li><li>Verifying ownership history through the land registry</li><li>Engaging trusted professionals to carry out due diligence</li><li>Ensuring there are no pre-existing disputes or defects that could affect the property’s marketability or transferability.</li></ul><p>In EFCC & ANOR V. IBRAHIM, Justice Peter Chudi Obiorah noted that “it is not in the pages of newspapers that encumbrances on landed properties are registered.”</p><p>Reliable sources of title include:</p><ul><li>Traditional evidence</li><li>Registered documents</li><li>Acts of possession over time</li><li>Ownership of adjacent land</li></ul></div><div class=\"section\"><h3>Foreign Investment Regulations</h3><p>In a plethora of decided cases, the Courts have held that the application of the Land Use Act 1978 is wholly for the benefit of Nigerians. However, foreign investors are permitted to own real estate in Nigeria, but certain restrictions apply. They must comply with:</p><ul><li>Nigerian Investment Promotion Commission (NIPC) Act</li><li>Companies and Allied Matters Act (CAMA) 2020</li><li>Foreign Exchange (Monitoring and Miscellaneous Provisions) Act</li></ul><p>While the Land Use Act prioritizes Nigerians, foreigners may invest indirectly through Nigerian-incorporated entities, provided legal and regulatory conditions are met.</p></div><div class=\"section\"><h3>Zoning and Planning Compliance</h3><p>Buying land doesn’t automatically mean you can build anything on it. Zoning laws define what a piece of land can be used for, for residential, commercial, industrial, or agricultural purposes. Land use in Nigeria is governed by a mix of federal, state, and local zoning laws.</p><p>Violating zoning regulations can lead to hefty penalties, demolition of structures, or project delays. For instance, in 2024, several buildings were demolished in Lagos for violating the Lagos State Urban and Regional Planning and Development (Amendment) Law 2019.</p><p>Land zoning is aimed at:</p><ul><li>Optimizing land use</li><li>Promoting orderly development</li><li>Ensuring efficient resource allocation</li><li>Fostering sustainable and well-structured communities.</li></ul></div><div class=\"section\"><h3>Real Estate Taxation in Nigeria</h3><p>Taxes are often overlooked when budgeting for a property purchase, but failure to pay them can result in penalties, legal action, or difficulties reselling the property. Investors must factor in multiple taxes when buying or developing property, including:</p><ul><li>Capital Gains Tax of 10% on profits from the sale</li><li>Stamp Duties (vary by state and document type)</li><li>Personal Income Tax</li><li>Company Income Tax for corporate investors</li></ul></div><div class=\"section\"><h3>Legal Conflict Resolution Mechanisms</h3><p>Conflict may arise at any time within the real estate investment and development cycle, from land ownership and title disputes, breach of contract, regulatory non-compliance, opposition from the community, and the list is endless.</p><p>Depending on the nature of the conflict, resolution may be pursued in court through litigation or alternatives such as negotiation, mediation, arbitration, or regulatory intervention, continuity, and a stable real estate market.</p><p>Effective conflict resolution mechanisms are crucial to maintaining investor confidence, ensuring project continuity. In Nigeria, real estate conflicts are governed by the Land Use Act 1978, the Urban and Regional Planning Act, contract law, state laws, the civil procedure rules of each state, and other relevant laws, regulations, and policies.</p><p>Conflict resolution can take the form of:</p><ul><li>Litigation in Nigerian courts</li><li>Alternative Dispute Resolution (ADR) mechanisms like mediation, arbitration, or negotiation</li><li>Regulatory interventions</li></ul><p>Choosing ADR methods early helps save time, reduce legal costs, and preserve business relationships.</p></div><div class=\"section\"><h3>Best Legal Practices for Real Estate Transactions</h3><p>At Roothe-Kharis & Partners, we’d guide you through the complexities of real estate investment with a focus on understanding the strategic approach that balances legal compliance, commercial viability, and risk management. With extensive expertise in real estate transactions, Roothe-Kharis provides tailored legal solutions that support you throughout the entire property lifecycle - from acquisition and financing to development, management, and exit strategies.</p><p>How Roothe-Kharis & Partners Helps You:</p><ul><li>We conduct due diligence and verify all documentation.</li><li>We draft airtight agreements tailored to each transaction.</li><li>We guide clients through regulatory compliance, tax filings, and government approvals.</li><li>We offer dispute resolution services, prioritizing ADR to keep your projects on track.</li><li>We help structure investments to limit risk and maximize returns.</li></ul></div><div class=\"section\"><h3>Conclusion</h3><p>Navigating the legal landscape of real estate investment and development in Nigeria requires a thorough understanding of the regulatory framework, compliance requirements, and risk mitigation strategies. From land acquisition and title verification to zoning laws and contractual agreements, investors must be well-informed to avoid legal pitfalls and ensure profitable ventures.</p><p>Engaging experienced legal professionals is crucial to safeguarding investments and achieving long-term success in this dynamic sector. Our deep expertise in real estate law makes us well-versed in providing comprehensive advisory and legal services tailored to the unique needs of our clients.</p><p class=\"footer\">Do not hesitate to contact us if you seeking to explore new opportunities or expand your investment portfolios. By partnering with Roothe-Kharis, investors can confidently make informed decisions, minimize risks, and maximize the potential of their real estate investments in Nigeria.</p></div></body></html>"
  },
  {
    "link": "understanding-the-deed-of-assent-transferring-legal-title-to-beneficiaries-under-a-will",
    "image": "deed.jpg",
    "image2": "deed2.jpg",
    "title": "Understanding the Deed of Assent in Nigeria: Transferring Legal Title to Beneficiaries ",
    "text": " A Deed of Assent is an instrument or legal document that comes into existence in furtherance of the devolution of title to real property to beneficiaries under a Will.",
    "date": "12 June 2025",
    "content": "<body><h1>Understanding the New Tenancy Law of Lagos State: What Landlords Need to Know</h1><div class=\"section\"><h3>Introduction</h3><p>Navigating property rental in Lagos can be challenging for landlords, especially when legal obligations and tenant rights come into play. With the Lagos State Tenancy Law of 2011 still in effect, landlords, property managers, and real estate investors need to understand their responsibilities and rights to avoid legal pitfalls and ensure smooth property management.</p><p>In this guide, we break down key provisions of the Lagos Tenancy Law, highlight landlord obligations, tenant rights, legal remedies, and practical steps for risk management, positioning you to handle tenancy matters confidently and lawfully.</p></div><div class=\"section\"><h3>What is the Lagos State Tenancy Law?</h3><p>The Lagos State Tenancy Law of 2011 was enacted to regulate the relationship between landlords and tenants across residential and commercial properties. It covers tenancy creation, rent control, dispute resolution, and lawful eviction procedures. The law is applicable in all parts of Lagos except highbrow areas like Ikoyi, Victoria Island, Ikeja GRA, and Apapa.</p><p>Under the law:</p><ul><li>A tenant is any individual or business entity occupying premises with the payment of rent or by the operation of law. NOT any person who unlawfully occupies under a bona fide claim to be the owner.</li><li>A landlord is anyone receiving rent from any person for the occupation of any premises in respect of which he has a right to receive such rent. Whether as an owner, an attorney, a solicitor, an agent, or a caretaker.</li></ul></div><div class=\"section\"><h3>Creating a Tenancy Agreement Under the Law</h3><p>A tenancy agreement is created when a landlord grants a person or business the right to occupy a property in exchange for payment. This agreement can be:</p><ul><li>Oral or written</li><li>Expressed or implied</li><li>Fixed-term or periodic (monthly, yearly)</li></ul><p>Landlords must ensure that tenancy agreements are clear, fair, and ideally documented to protect their interests.</p></div><div class=\"section\"><h3>Landlord Responsibilities Under the Tenancy Law</h3><p>Being able to comply with the law and maintain a good landlord-tenant relationship with your tenant is very important. To do that, landlords must:</p><ul><li>Issue a payment receipt to tenants for the payment of rent. A landlord who fails to issue a rent payment receipt is guilty of an offence and liable to pay a fine of N100,000. Issue a separate receipt for the payment of the security deposit to cover damages and repairs to the premises, services and facilities, and service charge.</li><li>Avoid disturbing the tenant's quiet and peaceable enjoyment of the premises. Peace and quiet enjoyment include the tenant’s right to privacy, freedom from unreasonable disturbance, exclusive possession of the premises, right to common areas for reasonable and lawful purposes.</li><li>Pay all rates and charges as stipulated by law, like land use charge, LAWMA charge, etc.</li><li>Keep the premises insured against loss or damage, e.g, by providing maximum security for the safety of your tenants.</li><li>Terminating or restricting the use of a common facility or service for the use of the premises.</li><li>Not seize any item or property of the tenant or interfere with the tenant's access to his personal property.</li><li>As a landlord, you are to effectively repair and maintain the external and general parts of the premises.</li><li>Ensure facilities like electricity and water are functional and not arbitrarily cut off. Which can lead to tenants getting frustrated.</li></ul></div><div class=\"section\"><h3>Rent Control and Advance Payment Under the Tenancy Law</h3><p>What qualifies as rent includes money paid or agreed to be paid, value given or agreed to be given, any equivalent given in kind or labour, in consideration of which a landlord has permitted any person to use and occupy any land, premises, or other corporeal heritament.</p><p>The use of common areas does not include any charge for services or facilities provided in addition to the occupation of the premises. It is a criminal offence for a landlord to request:</p><ul><li>Demand or receive from an existing monthly tenant six (6) months’ rent in advance.</li><li>Demand or receive from an existing yearly tenant, one (1) year's rent in advance.</li><li>Demand or receive from a new or proposed tenant, one (1) year in advance.</li></ul><p>Any landlord who is caught or reported violating these provisions can attract a ₦100,000 fine or up to 3 months' imprisonment.</p></div><div class=\"section\"><h3>Rent Increment Rules: What Tenants Must Know</h3><p>The rent increment must be mutually agreed upon. A landlord cannot unilaterally increase rent. In a situation where, after the landlord has increased rent, the tenant refuses to pay the increased rent, the tenant can challenge the increment in court, and the court will:</p><ul><li>Compare rent in similar locations</li><li>Consider the landlord's reasons (e.g., added amenities)</li><li>Allow the tenant to pay rent into court until the matter is resolved</li></ul><p>Cases like CHISCO TRANSPORT (NIG) LTD V. NJOKU (2024) reinforce this principle, making it clear that all increments must be backed by written agreements. Since the landlord and tenancy relationship is a contractual relationship.</p><p>In COBRA LTD V. OMOLE ESTATE AND INVESTMENT LTD (2000) 1 NWLR (Pt. 655), the court held that unless there is an agreement between the landlord and the tenant, a landlord’s unilateral decision to increase rent is ineffective.</p><p>In a more recent case of CHISCO TRANSPORT (NIG) LTD V. NJOKU & ORS (2024) LPELR-62333 (CA), the court held that a landlord does not possess the power to unilaterally increase rent. The matter of rent increment must be supported by an agreement to that effect.</p></div><div class=\"section\"><h3>Grounds for Landlords to Reclaim Properties</h3><p>Landlords can recover possession if:</p><ul><li>Right to obtain a court order to re-enter and end the tenancy if the tenant breaches any covenants of the tenancy agreement;</li><li>Right to apply for court order for possession on the grounds that the premises is being used for immoral or illegal purposes, the premises has been abandoned, the premises is unsafe and unsound as to constitute a danger to human life or property, an act of intolerable nuisance by the tenant such that induces a breach of the tenancy agreement.</li><li>Right to recover the premises where a fixed tenancy has ended</li><li>The 7-day notice of the Owner’s intention to recover possession has been served on the tenant.</li></ul><p>However, any eviction must follow due process. Using harassment, cutting off utilities, or intimidation is illegal and punishable by ₦250,000 fine or 6 months in jail.</p></div><div class=\"section\"><h3>Notice Periods for Tenancy Eviction</h3><p>Eviction notices vary by tenancy type:</p><ul><li>1 week: Tenancy at will</li><li>1 month: Monthly tenants</li><li>3 months: Quarterly or half-yearly tenants</li><li>6 months: Yearly tenants</li><li>7 days: Fixed-term tenancies after expiration</li></ul><p>All notices must be served from the date rent was paid and must comply with legal timelines to be valid in court.</p></div><div class=\"section\"><h3>Risk Management for Landlords</h3><p>To mitigate potential disputes and financial losses, landlords should:</p><ul><li>Conduct thorough tenant screening to reduce default risks.</li><li>Draft detailed tenancy agreements with clear terms</li><li>Comply with all notice requirements and rent review timelines</li><li>Seek legal help early when tenants default or issues arise</li></ul></div><div class=\"section\"><h3>Legal Dispute Resolution Under the Tenancy Law</h3><p>The tenancy law encourages landlords and tenants to use mediation or reconciliation as the first approach when dealing with dispute resolution. Without the consent of the landlord and the tenant, the court has the right to refer tenancy disputes to legal bodies like the Citizen Mediation Centre or the Lagos Multi-Door Courthouse.</p><p>Where mediation is successful, a mediation agreement is signed and enforced as a court judgment, saving time and litigation costs.</p></div><div class=\"section\"><h3>Conclusion</h3><p>The Lagos State Tenancy Law of 2011 serves as a comprehensive guide for lawful, respectful, and structured rental relationships. For landlords, it is not just about collecting rent, it is about protecting your investment while complying with the law.</p><p>By understanding the legal landscape, issuing proper notices, maintaining the premises, and respecting tenant rights, landlords can avoid costly disputes and operate more confidently in the Lagos property market.</p><p class=\"footer\">At Roothe-Kharis, we specialize in landlord-tenant legal advisory, helping real estate investors, property managers, and landlords navigate the complexities of Lagos tenancy laws. Whether you need help drafting airtight agreements, handling disputes, or recovering rent legally, our expert legal team is here to support you.</p></div></body></html>"
  },
  {
    "link": "understanding-the-deed-of-assent-transferring-legal-title-to-beneficiaries-under-a-will",
    "image": "fixed.jpg",
    "image2": "fixed2.jpg",
    "title": " The Fixed Exchange Rate Clause: Safeguarding Founders In Cross-Border Financing",
    "text": "Every startup founder dreams of landing that breakthrough investment, especially when it comes from foreign venture capital firms or angel investors. But while valuation, dilution, equity split, and repayment terms dominate most negotiations, one critical issue often slips through the cracks: The currency exchange rate. ",
    "date": "13 June 2025",
    "content": "<body><h1>Fixed Exchange Rate Clause: Safeguarding Founders in Cross-Border Financing</h1><div class=\"section\"><h3>Introduction</h3><p>Every startup founder dreams of landing that breakthrough investment, especially when it comes from foreign venture capital firms or angel investors. But while valuation, dilution, equity split, and repayment terms dominate most negotiations, one critical issue often slips through the cracks: The currency exchange rate.</p><p>In countries like Nigeria, Ghana, Kenya, or any fast-growing emerging market, currency depreciation is not a hypothetical threat, it’s a constant reality. Between 2023 and 2024, the Nigerian Naira, for example, lost over 50% of its value against the US Dollar. For founders receiving foreign-denominated funding, this meant ballooning repayment obligations, eroded profit margins, and in some cases, business failure.</p><p>This article sheds some insight into a seemingly simple yet profoundly impactful tool that startup founders can use to mitigate currency exchange risks, ensuring financial predictability and stability for founders navigating cross-border financing.</p></div><div class=\"section\"><h3>What Is a Fixed Exchange Rate Clause?</h3><p>The Fixed Exchange Rate clause, also known as the \"Pegging Clause,\" is a contractual provision that establishes a predetermined exchange rate for financial transactions, regardless of the subsequent fluctuations in the currency market. By locking in the exchange rate at the outset, this clause ensures that repayment obligations are consistent, shielding parties from the adverse effects of currency volatility.</p><p>For example, if a Nigerian startup raises $100,000 in January 2025, when the exchange rate was still ₦800/$1. Without a fixed exchange rate clause, if the Naira crashes to ₦1,500/$1 by repayment time, the startup would need to pay ₦150,000,000 instead of ₦80,000,000—nearly 100% increase in repayment cost.</p><p>For an early-stage startup managing thin margins, this can mean:</p><ul><li>Drained working capital</li><li>Missed payroll</li><li>Failed operations</li><li>Or falling into unpayable debt</li></ul><p>With a fixed rate clause tied to the original ₦800/$1, the repayment remains predictable, allowing founders to plan cash flow with confidence and shield their businesses from currency risk.</p></div><div class=\"section\"><h3>Benefits of the Fixed Exchange Rate Clause in Cross-Border Financing</h3><p>Most startups in Africa and other emerging markets raise funds in foreign currencies, while their revenue and expenses remain in local currency, like Naira. Without a fixed exchange rate clause, founders may end up paying significantly more than they planned when it’s time to repay investors due to currency depreciation.</p><p>The Fixed Exchange Rate Clause offers several benefits to founders, mostly. These benefits include:</p><ol><li><strong>Financial Predictability and Clarity:</strong> Effectively incorporating a fixed exchange clause provides an unambiguous understanding of repayment terms, both for the investors and the founder, and further minimizes the potential for disputes arising from exchange rate fluctuations.</li><li><strong>Builds Investor Confidence:</strong> Investors are usually more confident in negotiating with founders who demonstrate sound financial understanding and a proactive approach to risk management, thereby streamlining negotiations by eliminating uncertainty related to currency exchange risks.</li><li><strong>Protection Against Currency Volatility:</strong> The Fixed Exchange Rate Clause safeguards founders in emerging markets and frontier markets from the unexpected financial strain caused by currency depreciation and encourages long-term financial planning and forecasting.</li><li><strong>Legal Shield for Founders:</strong> By formalizing this clause in legal agreements, startups can avoid unnecessary exposure to market risks and legal disputes related to currency conversion.</li><li><strong>Encourages Long-Term Thinking:</strong> Startups using this clause are more likely to think holistically about growth, rather than chasing short-term currency advantages.</li></ol></div><div class=\"section\"><h3>A Simple Guide on How to Draft a Fixed Exchange Rate Clause</h3><p>If you're working with a legal team or using a startup lawyer, here’s how to make sure the clause is properly structured. Here’s a practical framework for adding this clause to your funding agreement:</p><ul><li><strong>Define the fixed exchange rate:</strong> Example, ₦800/$1.</li><li><strong>Specify the determination date:</strong> This could be the signing date, funding date, or disbursement date.</li><li><strong>Mention involved currencies:</strong> Clarify the source, like USD, and repayment currency, like NGN.</li><li><strong>Include a dispute resolution method:</strong> Clearly outline how disagreements on the application of the exchange rate will be resolved, arbitration, mediation, etc.</li></ul><p>To avoid tragic stories, it’s advisable to always consult with legal professionals when drafting financial contracts involving currency exchange.</p></div><div class=\"section\"><h3>Why Founders Trust Roothe-Kharis for Legal Guidance</h3><p>After years of experience advising dozens of startups on how to legally structure their funding agreements, especially when foreign capital is involved. Roothe-Kharis & Partners go beyond boilerplate clauses; We draft strategies and build frameworks to protect your equity, cash flow, and growth potential.</p><p>We offer:</p><ul><li>Custom funding agreement reviews</li><li>Legal protection against currency and investor risk</li><li>Cross-border compliance expertise</li><li>One-on-one founder consultations</li></ul></div><div class=\"section\"><h3>Conclusion</h3><p>The Fixed Exchange Rate Clause is more than just a financial safeguard, it’s a strategic tool for long-term sustainability and growth. In a world where currency exchange can change overnight, locking in predictable terms gives your startup the edge it needs.</p><p>Let Roothe-Kharis be your trusted legal partner. We help founders like you create solid foundations for local and international funding. The fixed exchange rate clause is an indispensable tool for founders engaged in cross-border financing. Incorporating a fixed exchange rate clause offers protection against currency volatility and ensures financial predictability, while safeguarding the interests of founders.</p><p class=\"footer\">At Roothe-Kharis, we specialize in providing expert legal guidance to founders navigating the complexities of cross-border transactions. Our team is committed to crafting tailored solutions that protect your interests and ensure compliance with applicable laws. We are available for consultations to secure the financial future of founders who are seeking to achieve business objectives with confidence. Need help drafting your funding agreements? Contact Roothe-Kharis & Partners today to get expert legal support and secure your startup’s future.</p></div></body></html>"
  },
  {
    "link": "understanding-the-deed-of-assent-transferring-legal-title-to-beneficiaries-under-a-will",
    "image": "joint1.jpg",
    "image2": "joint2.jpg",
    "title": "Joint Venture Agreements (JVAS) in Nigeria: A guide for Businesses and Investors",
    "text": "Discover the essentials of Joint Venture Agreements (JVAs) in Nigeria. Learn how JVAs help businesses grow, the types of joint ventures, key legal considerations, and why partnering with a local law firm ensures success.",
    "date": "13 Jun 2025",
    "content": "<body><h1>Joint Venture Agreements (JVAs) in Nigeria: A Guide for Businesses and Investors</h1><div class=\"section\"><p>Discover the essentials of Joint Venture Agreements (JVAs) in Nigeria. Learn how JVAs help businesses grow, the types of joint ventures, key legal considerations, and why partnering with a local law firm ensures success.</p></div><div class=\"section\"><h3>Introduction</h3><p>Imagine trying to expand your business into a new market but lacking either the capital, local knowledge, or technical expertise. What if you could team up with another business to fill in those gaps, while still retaining your brand’s identity?</p><p>That’s where Joint Venture Agreements (JVAs) come in. A Joint Venture Agreement is a legal contract between two or more parties who agree to collaborate on a specific business project while maintaining their separate legal identities. This agreement outlines the rights, responsibilities, profit-sharing arrangements, and governance structure of the joint venture. Businesses often enter into JVA to combine resources, expertise, and market access for mutual benefit, especially in industries such as real estate, technology, energy, and manufacturing.</p><p>Joint ventures provide several strategic advantages, including risk-sharing, cost reduction, and accelerated market entry. By pooling their strengths, businesses can achieve goals that may be difficult to accomplish independently. However, JVAs also come with potential challenges, such as cultural differences, management conflicts, and regulatory risks. These challenges highlight the importance of a well-structured agreement that clearly defines roles, contributions, and dispute resolution mechanisms.</p></div><div class=\"section\"><h3>Why Joint Ventures Matter for Business Growth</h3><p>For many businesses, especially those navigating expansion, new markets, or innovation, Joint Ventures have become a powerful strategy for scaling without taking on all the risk alone, like:</p><ol><li><strong>Leveraging Shared Resources:</strong> One of the most significant advantages of a JV is the ability to pool resources from multiple entities. This can include financial capital, technology, production capabilities, or distribution networks. When companies collaborate, they can enhance efficiency and innovation, ultimately leading to increased productivity and competitive advantage.</li><li><strong>Cutting Costs:</strong> Joint ventures allow companies to achieve economies of scale, reducing per-unit production costs and sharing operational expenses such as labor, marketing, and supply chain costs. In industries that require high investment in technology or infrastructure, a JV makes it more feasible to implement costly advancements while mitigating financial risk.</li><li><strong>Tapping into Combined Expertise:</strong> JVs enable businesses to exchange knowledge, skills, and best practices. For example, a company with strong research and development (R&D) capabilities can partner with another company that excels in market penetration. This cross-industry or cross-sector collaboration drives innovation and efficiency, leading to enhanced product offerings and better customer satisfaction.</li><li><strong>Entering Foreign Markets:</strong> JVs are particularly valuable when entering foreign markets, especially in regions with legal restrictions on foreign direct investment (FDI). Many countries impose ownership restrictions that limit foreign companies from operating independently. In such cases, a JV with a local partner provides the necessary legal access while also benefiting from the local entity’s market knowledge, distribution channels, and regulatory compliance expertise.</li><li><strong>Navigating Regulatory Barriers:</strong> Joint Venture Agreements serve as a strategic entry mode for businesses facing legal and regulatory barriers in foreign markets. By forming partnerships with local firms, companies can navigate legal complexities, minimize risks, and accelerate market penetration, thereby contributing to economic growth through trade expansion, job creation, and technology transfer. For example, countries like China, India, and Indonesia have historically imposed restrictions requiring foreign companies to form joint ventures with local businesses. The Nigerian Oil and Gas Industry Content Development Act (2010) promotes local participation, requiring foreign companies to partner with Nigerian firms to carry out oil and gas operations.</li></ol></div><div class=\"section\"><h3>Types of Joint Ventures</h3><p>Joint ventures can be structured in different ways depending on the goals, level of collaboration, and legal structure agreed upon by the parties involved. Here are the two major types:</p><h3>1. Corporate (Equity) Joint Ventures</h3><p>A Corporate or Equity Joint Venture is a business arrangement where two or more parties provide capital, assets, or other resources in agreed proportions to establish a new legal entity (mostly a joint venture limited liability company), sharing ownership (by shareholding), profits, and risks. In this type of arrangement, the parties carry on business that involves expertise provided by each of them. An important document in this type of arrangement is the shareholders' agreement and the articles of association.</p><h3>2. Contractual (Unincorporated) Joint Ventures</h3><p>A Contractual Joint Venture (CJV) is a business arrangement where two or more parties (which could be businesses or individuals) collaborate based on a legally binding agreement rather than forming a separate legal entity. Each party retains ownership of its assets and operates independently while sharing responsibilities, risks, and profits according to the contract terms. Examples of Contractual Joint Ventures include agency agreements, distribution agreements, franchise agreements, intellectual property license agreements, collaboration agreements, consortium agreements, partnership agreements, cross-supply agreements, etc.</p></div><div class=\"section\"><h3>Key Elements of a Solid Joint Venture Agreement</h3><ol><li><strong>Clear Objectives and Defined Roles:</strong> The agreement must explicitly state the purpose of the joint venture, ensuring that all parties are aligned on the goals and expected outcomes. Additionally, each party’s role, responsibilities, and contributions—whether financial, technical, or operational— should be clearly outlined. This prevents misunderstandings and ensures that each partner understands their obligations.</li><li><strong>Financial and Governance Structure:</strong> The agreement should specify how profits, losses, and expenses will be distributed among the partners. It must also outline the ownership structure, specifying whether the joint venture will operate as a partnership, corporation, or limited liability entity. The governance framework should establish decision-making processes, voting rights, and the authority of each partner. Defining financial commitments, such as funding requirements, capital contributions, and reinvestment strategies, ensures financial stability and transparency throughout the partnership.</li><li><strong>Dispute Resolution Mechanisms:</strong> Disputes are common in business collaborations, making it crucial to incorporate strong dispute resolution mechanisms within the agreement. A well-drafted JVA should outline procedures for handling conflicts, including mediation, arbitration, or litigation. This ensures that disputes are resolved efficiently without damaging the long-term viability of the partnership. Additionally, the agreement should define the steps for addressing breaches of contract, deadlocks, or partner disagreements. Including provisions for amendments or modifications to the agreement further allows the joint venture to adapt to changing business conditions.</li><li><strong>Legal and Regulatory Compliance:</strong> Conducting due diligence and compliance checks plays a critical role in securing the joint venture’s legitimacy and long-term success. A good agreement should ensure that the joint venture adheres to local and international laws, including corporate regulations, tax requirements, and competition laws. Conducting due diligence on each partner’s financial and legal standing before formalizing the agreement helps mitigate risks.</li><li><strong>Intellectual Property and Confidentiality:</strong> Intellectual property (IP) rights, confidentiality, and non-compete clauses should also be included to protect business assets and prevent unfair competition. Moreover, having a well-defined exit strategy, including layout options, asset distribution, and dissolution procedures, allows partners to disengage from the joint venture smoothly if necessary.</li><li><strong>Exit Strategy:</strong> Define how the venture can be dissolved, bought out, or restructured. Include asset distribution, partner exit conditions, and succession plans. An effective agreement not only safeguards the interests of all parties involved but also creates a solid foundation to achieve shared business goals.</li></ol></div><div class=\"section\"><h3>Conclusion</h3><p>Joint ventures represent businesses with an opportunity to expand, innovate, and leverage complementary strengths. However, they require careful planning, clear agreements, and legal compliance to ensure success.</p><p>For businesses and investors considering joint ventures, clear objectives, robust governance, and structured dispute resolution mechanisms are crucial. Thorough legal due diligence ensures compliance and safeguards intellectual property, while expert guidance in drafting agreements helps mitigate risks and adapt to changing conditions.</p><p>Looking ahead, joint ventures will be shaped by globalization, digital transformation, and emerging technologies like AI and blockchain. Cross-border collaboration will demand greater regulatory awareness, while sustainability and ESG principles will increasingly influence partnership structures.</p><p class=\"footer\">Contact us if you need any help with joint venture agreements. Roothe-Kharis & Partners specializes in structuring and reviewing joint venture agreements to ensure legal soundness and commercial viability. Send us a message to secure a profitable agreement.</p></div></body></html>"
  },
  {
    "link": "understanding-the-deed-of-assent-transferring-legal-title-to-beneficiaries-under-a-will",
    "image": "board1.jpg",
    "image2": "board2.jpg",
    "title": " How to Determine the Quorum for Board Meetings in Nigeria: A Practical Guide for Companies",
    "text": " Learn how to determine quorum for board meetings under Nigeria’s CAMA 2020. This practical guide breaks down legal requirements, real-life scenarios, and best practices to ensure valid board decisions and corporate compliance. ",
    "date": "13 Jun 2025",
    "content": "<body><h1>How to Determine the Quorum for Board Meetings in Nigeria: A Practical Guide for Companies</h1><div class=\"section\"><h3>Introduction</h3><p>In today’s corporate environment, where decisions at the board level can significantly influence a company’s trajectory, understanding how to properly establish a quorum is not just a technicality; it’s a legal necessity.</p><p>Whether you're a company secretary preparing board documentation or a director attending your first meeting, this guide will walk you through how to determine quorum for board meetings under the Companies and Allied Matters Act (CAMA) 2020, with examples to simplify the process.</p><p>Ensuring a valid quorum is essential for any productive board of directors meeting. Without it, key decisions may be legally unenforceable, putting an organization at risk. But how exactly is the right quorum determined? In this article, we break down the legal requirements, best practices, and common pitfalls in establishing and verifying quorum, helping directors, corporate secretaries, and executives maintain compliance and governance standards.</p></div><div class=\"section\"><h3>Why Does Quorum Matter in a Board Meeting?</h3><p>In the corporate world, a quorum is the minimum number of people required to be present for a meeting to be valid and for decisions to carry legal weight.</p><p>Think of it as a safety net. It ensures that important decisions are made with enough representation and participation to reflect the company’s governance structure. Without a quorum, any resolutions passed can be challenged or rendered void.</p><p>Section 289 of the Companies and Allied Matters Act 2020 provides that the first meeting of the Board of Directors shall be held not later than 6 months after the incorporation of the company.</p><p>The agenda of the first board meeting should include the election of the Chairman from among the directors, the appointment of an auditor, and the appointment of a Company Secretary. The Board of Directors meeting is held from time to time to discuss major problems, areas of concern, vote on decisions, review the company’s performance, and consider policies.</p></div><div class=\"section\"><h3>What Does CAMA Say About Board Meetings?</h3><p>Quorum for a Board of Directors Meeting Section 256 (2) of the Companies and Allied Matters Act (CAMA) 2020 makes provision for the number of members of a company that constitute a quorum for the purpose of a meeting.</p><p>“Except in the case of a company with one member or provided in the articles, the quorum for meetings of a company is one-third of the total number of members of the company or 25 members (whichever is less) present in person or by proxy, but where the number of members is not a multiple of three, then the number nearest to one third, but where the number of members is six or less, the quorum is two members and to determine a quorum, all members or their proxies shall be counted.”</p><p>Section 290 (1) of the Companies and Allied Matters Act 2020 provides for the quorum of a board meeting as follows:</p><p>“Unless the articles provide otherwise, the quorum necessary for the transaction of the business of directors are two where there are not more than six directors, but where there are more than six directors, the quorum is one-third of the number of directors, and where the number of directors is not a multiple of three, then the quorum is one third to the nearest number.”</p></div><div class=\"section\"><h3>Practical Scenarios to Understand Quorum</h3><p>Let’s break it down with simple math:</p><h3>Scenario 1:</h3><p>Plum Ltd has 3 directors</p><ul><li>Quorum = 3 ÷ 3 = 1</li><li>Since the law requires at least two of the six or fewer directors, the quorum is 2</li></ul><h3>Scenario 2:</h3><p>Plum Ltd has 5 directors</p><ul><li>Quorum = 5 ÷ 3 = 1.67</li><li>Rounded up → 2 directors required</li></ul><h3>Scenario 3:</h3><p>Plum Ltd has 7 directors</p><ul><li>Quorum = 7 ÷ 3 = 2.33</li><li>Rounded up → 3 directors required</li></ul></div><div class=\"section\"><h3>What About Virtual Board Meetings?</h3><p>In today’s digital world, many boards hold meetings virtually. Is quorum still required? Yes.</p><p>Under Section 240(2) of CAMA, virtual board meetings are valid if the company’s articles permit them. Quorum still applies and must be met by counting all participating directors, whether they attend physically or via digital platforms (e.g., Zoom, Microsoft Teams, Google Meet).</p><p>This is particularly relevant in hybrid workplaces where directors may attend from different locations.</p></div><div class=\"section\"><h3>The Bigger Picture: Why You Should Care</h3><p>Understanding and properly calculating quorum is critical for:</p><ul><li>Legitimizing board decisions</li><li>Avoiding legal challenges</li><li>Ensuring governance transparency</li></ul><p>It’s not just about counting heads. It’s about making sure your company is protected from procedural errors that can lead to disputes or compliance failures.</p></div><div class=\"section\"><h3>Final Thoughts</h3><p>Determining and maintaining a proper quorum is not just a procedural formality. It is a legal safeguard that upholds the integrity of the board’s decisions. Whether your organization follows statutory laws or custom bylaws, understanding quorum, how to calculate it, and its requirements helps prevent disputes, ensures compliance, and keeps corporate governance on solid footing.</p><p>As hybrid and remote meetings become more common, boards must adapt their practices to confirm quorum efficiently while meeting legal standards. Proactive planning, clear bylaws, and proper record-keeping are key to avoiding challenges down the line.</p><p class=\"footer\">If your board needs guidance on quorum rules, governance best practices, or corporate compliance, ROOTHE-KHARIS & PARTNERS’ experienced corporate attorneys are here to help. Contact us today for tailored advice that keeps your organization protected and productive.</p></div></body></html>"
  },
  {
    "link": "understanding-the-deed-of-assent-transferring-legal-title-to-beneficiaries-under-a-will",
    "image": "tax1.jpg",
    "image2": "tax2.jpg",
    "title": "Key Tax Registration Requirements for Businesses and Individuals in Nigeria",
    "text": "Discover the key tax registration requirements for individuals and businesses in Nigeria, including how to obtain your TIN and stay compliant with FIRS and JTB regulations. ",
    "date": "13 June 2025",
    "content": "<body><h1>Key Tax Registration Requirements for Businesses and Individuals in Nigeria</h1><div class=\"section\"><h3>Introduction</h3><p>Starting a business or formalizing your income stream in Nigeria? One of the very first steps is tax registration, specifically, obtaining a Tax Identification Number (TIN). Whether you're a sole proprietor, small business owner, or incorporated company, securing a TIN is essential for compliance, credibility, and financial functionality.</p><p>The TIN is prepared and issued by the Federal Inland Revenue Service (FIRS). Section 8(1)(b) of the FIRS Establishment Act 2007 empowers the FIRS to register taxpayers and issue a TIN, and the Joint Tax Board (JTB) is empowered by Section 86(1) of the Personal Income Tax Act (PITA). TIN is issued to individuals or registered businesses/incorporated companies for proper tax identification and verification.</p><p>In this guide, we outline the importance of TIN, how to get it, and the legal framework that governs tax registration in Nigeria.</p></div><div class=\"section\"><h3>What is a Tax Identification Number (TIN)?</h3><p>A Tax Identification Number (TIN) is a unique number assigned to individuals and businesses by the Federal Inland Revenue Service (FIRS) or the Joint Tax Board (JTB). It is used to identify taxpayers and track tax obligations, payments, and compliance.</p><p>TIN is required by law and governed by the following statutes:</p><ul><li>Section 8(1)(b) of the FIRS Establishment Act 2007 mandates the registration of taxpayers and the issuance of TIN.</li><li>Section 86(1) of the Personal Income Tax Act (PITA), which empowers the JTB to manage individual tax identification.</li></ul></div><div class=\"section\"><h3>Why Do You Need a TIN?</h3><p>Obtaining a TIN goes far beyond meeting a legal obligation—it’s a gateway to numerous business and financial activities. Here are some key benefits:</p><ol><li>For obtaining a Tax Clearance Certificate (businesses).</li><li>For opening a Corporate Bank Account.</li><li>To carry out foreign exchange transactions.</li><li>For applying for a trade license and an import and export license.</li><li>For applying for Government loans.</li><li>For making applications for a Certificate of Occupancy.</li><li>For filing annual income tax returns.</li><li>For filing annual summaries (i.e., for persons required to deduct tax at source).</li><li>For accounting for Value Added Tax (VAT).</li></ol><p>Without a TIN, many routine financial transactions and compliance requirements become impossible or delayed.</p></div><div class=\"section\"><h3>How to Apply for a TIN as a Registered Business in Nigeria</h3><p>There are two main options for obtaining a TIN in Nigeria:</p><h3>1. Apply In Person at the Nearest FIRS Office</h3><p>This method is often preferred by businesses that want immediate verification or personalized guidance.</p><p>Requirements:</p><ol><li>Business Name Registration Certificate (CAC)</li><li>Typed Application Letter on your business letterhead addressed to the FIRS office</li><li>Completed VAT Form 001 (duly filled and stamped)</li><li>Official Business Stamp</li><li>Utility Bill as proof of business address</li></ol><p>Note: Bring the original documents and two photocopies each. Originals are required only for sighting.</p><h3>B. Apply Online Through the Joint Tax Board (JTB) Portal</h3><p>This digital option allows individuals and businesses to apply for a TIN without visiting a physical office.</p><p>Steps:</p><ol><li>Visit the JTB TIN Request Portal</li><li>Provide a valid email address</li><li>Provide a registered mobile number</li><li>Fill out the form with accurate details</li><li>Submit the application</li></ol><p>Timeline: Your TIN is typically generated within 48 hours of successful submission.</p></div><div class=\"section\"><h3>For Individuals (Self-Employed or Freelancers)</h3><p>Self-employed professionals, freelancers, or consultants must also obtain a TIN to file personal income tax and meet compliance standards. The process is similar to the business process, but geared toward individual tax registration under PITA.</p><p>You’ll need:</p><ul><li>Valid means of identification (e.g., NIN, driver’s license, or passport)</li><li>Utility bill as address proof</li><li>Employment or freelance documentation (if applicable)</li></ul></div><div class=\"section\"><h3>Conclusion</h3><p>A Tax Identification Number (TIN) is not just a formality—it’s the foundation of operating a legally compliant business or professional practice in Nigeria. From opening a bank account to securing government contracts, TIN plays a central role in your business growth and financial credibility.</p><p>Thankfully, with both physical and digital channels available through FIRS and JTB, obtaining your TIN has never been easier.</p><p class=\"footer\">Need Help Navigating Tax Registration or Compliance? At Roothe-Kharis & Partners, we offer tailored support for TIN registration, VAT compliance, tax filings, and more. Our corporate and tax attorneys can guide you through every step to ensure your business stays legally protected and operationally sound. Contact us today to get started on your tax compliance journey.</p></div></body></html>"
  },
  {
    "link": "understanding-the-deed-of-assent-transferring-legal-title-to-beneficiaries-under-a-will",
    "image": "transfer1.jpg",
    "image2": "transfer2.jpg",
    "title": "Understanding Transfer Pricing and the Advance Pricing Agreement (APA) Framework in Nigeria ",
    "text": "Learn how transfer pricing regulations and the Advance Pricing Agreement (APA) framework work in Nigeria. Discover key principles, compliance requirements, and implications for multinationals and businesses with cross-border transactions.",
    "date": "13 Jun 2025",
    "content": "<body><h1>Understanding Transfer Pricing and the Advance Pricing Agreement (APA) Framework in Nigeria</h1><div class=\"section\"><h3>Introduction</h3><p>In today's interconnected global economy, many Nigerian businesses and multinational enterprises (MNEs) operate across borders. While this opens up new opportunities, it also introduces complex tax challenges, chief among them, transfer pricing.</p><p>Transfer pricing governs how related entities price goods, services, and intellectual property in cross-border transactions. When not handled correctly, these transactions can be seen as mechanisms for shifting profits to low-tax jurisdictions, thereby eroding a country’s tax base.</p><p>To prevent this and ensure fair taxation, Nigeria has put in place an evolving legal and regulatory framework, bolstered recently by the Advance Pricing Agreement (APA) Guidelines issued by the Federal Inland Revenue Service (FIRS).</p></div><div class=\"section\"><h3>What is Transfer Pricing?</h3><p>Transfer pricing refers to the pricing of goods, services, or intangibles between related parties, such as parent companies and subsidiaries operating in different tax jurisdictions.</p><p>The key guiding standard is the Arm’s Length Principle, which states that the price charged between related parties must be comparable to what would have been charged between independent entities under similar circumstances.</p><p>In Nigeria, the Income Tax (Transfer Pricing) Regulations 2018, made under Section 4(2) of the FIRS Establishment Act 2007, embody this principle. It ensures that profits are correctly attributed and taxed in the jurisdictions where economic value is created.</p></div><div class=\"section\"><h3>Why Is Transfer Pricing So Important in Nigeria?</h3><p>As Nigeria’s economy continues to grow and attract international investment, transfer pricing plays a central role in:</p><ul><li>Preventing tax avoidance</li><li>Protecting Nigeria’s tax base</li><li>Encouraging transparency and compliance among multinational corporations</li></ul><p>However, enforcement is not without challenges. One key issue is the lack of readily available market data to benchmark transactions. This makes the application of the arm’s length principle more difficult than in more developed jurisdictions.</p></div><div class=\"section\"><h3>Global Context: OECD and the BEPS Framework</h3><p>Nigeria’s efforts to address transfer pricing are aligned with international best practices, especially those developed by the OECD under the Base Erosion and Profit Shifting (BEPS) initiative.</p><p>Launched in 2015, BEPS introduced a 15-point action plan to combat aggressive tax planning and cross-border profit shifting. Nigeria has since adopted several of these principles in its 2018 Transfer Pricing Regulations.</p><p>Key frameworks Nigeria aligns with include:</p><ul><li>The OECD Transfer Pricing Guidelines</li><li>The UN Manual on Transfer Pricing</li><li>The BEPS Action Plan (particularly Action 13 on transfer pricing documentation)</li></ul></div><div class=\"section\"><h3>What is the Advance Pricing Agreement (APA)?</h3><p>The Advance Pricing Agreement (APA) is a major step forward in Nigeria’s transfer pricing regime. It is a formal agreement between a taxpayer and the FIRS that predetermines the pricing method for related-party transactions over a fixed period.</p><p>Released on November 27, 2024, the APA Guidelines are designed to offer more certainty, compliance clarity, and dispute reduction for businesses involved in controlled transactions.</p><h3>Eligibility</h3><p>The APA applies to:</p><ul><li>Nigerian tax residents, and</li><li>Non-resident entities with a permanent establishment, significant economic presence, or other taxable presence in Nigeria.</li></ul></div><div class=\"section\"><h3>Key Objectives of the APA Framework</h3><p>According to Paragraph 4.0 of the Guidelines, the APA aims to:</p><ol><li>Minimize disputes between FIRS and taxpayers by setting pricing rules in advance</li><li>Provide tax certainty for long-term planning</li><li>Reduce compliance and litigation costs</li><li>Encourage fair tax practices and deter profit shifting</li><li>Prevent double taxation through bilateral or multilateral cooperation</li></ol></div><div class=\"section\"><h3>Types of APA Available in Nigeria</h3><p>Nigeria’s APA Guidelines offer three types of agreements (Paragraph 3.0):</p><ol><li><strong>Unilateral APA:</strong> An agreement between a taxpayer and the FIRS covering the pricing of transactions within Nigeria.</li><li><strong>Bilateral APA:</strong> Involves the taxpayer, FIRS, and a foreign tax authority, typically where the connected party resides. This provides more certainty on both sides of the transaction.</li><li><strong>Multilateral APA:</strong> Covers arrangements involving multiple jurisdictions, the Nigerian taxpayer, and connected persons in two or more foreign countries, along with their tax authorities.</li></ol></div><div class=\"section\"><h3>What Happens if You Don’t Comply?</h3><p>Failure to adhere to Nigeria’s transfer pricing regulations can result in significant consequences, including:</p><ul><li>Termination of APA for failure to submit required compliance reports</li><li>Penalties and interest where tax understatements occur</li><li>Legal liability for false or misleading information</li><li>Increased audit scrutiny by tax authorities</li></ul></div><div class=\"section\"><h3>Conclusion</h3><p>Nigeria’s transfer pricing landscape has evolved significantly, reflecting the country’s commitment to tax transparency and international best practices. While challenges remain, such as legal uncertainties, data limitations, and enforcement hurdles, the Nigerian government continues to refine its regulatory framework to ensure fair taxation of MNEs. The Nigerian APA Guidelines aim to streamline transfer pricing regulations, encourage tax compliance, and reduce disputes between taxpayers and tax authorities. The process is voluntary and highly beneficial for companies engaging in cross-border transactions, as it offers tax certainty and helps prevent double taxation.</p><p class=\"footer\">Need Expert Help with Transfer Pricing or APA? At Roothe-Kharis & Partners, we provide legal and advisory support for APA applications, transfer pricing documentation, risk assessment and benchmarking, dispute resolution, and audit readiness. Contact us today to ensure your business stays compliant and confident in its cross-border tax strategies.</p></div></body></html>"
  },
  {
    "link": "understanding-the-deed-of-assent-transferring-legal-title-to-beneficiaries-under-a-will",
    "image": "key1.jpg",
    "image2": "key2.jpg",
    "title": " Key Tax Registration Requirements for Businesses and Individuals",
    "text": "One of the key requirements of a business upon registration/ incorporation is to apply for a Tax Identification Number (TIN). The TIN is a unique number that identifies a registered business for the purposes of paying taxes.",
    "date": "13 Jun 2025",
    "content": "<body><h1>Key Tax Registration Requirements for Businesses and Individuals</h1><div class=\"section\"><h3>Introduction</h3><p>One of the key requirements of a business upon registration/incorporation is to apply for a Tax Identification Number (TIN). The TIN is a unique number that identifies a registered business for the purposes of paying taxes.</p><p>The TIN is prepared and issued by the Federal Inland Revenue Services (FIRS). Section 8(1)(b) of the FIRS Establishment Act 2007 empowers the FIRS to register Tax Payers and issue a TIN, and the Joint Tax Board (JTB) is empowered by Section 86(1) of the Personal Income Tax Act (PITA). TIN is issued to individuals or registered businesses/incorporated companies for proper tax identification and verification.</p></div><div class=\"section\"><h3>Benefits of Obtaining a Tax Identification Number (TIN)</h3><p>Some of the benefits and advantages enjoyed for obtaining Tax Identification Number include the following:</p><ol><li>For obtaining a Tax Clearance Certificate (businesses).</li><li>For opening a Corporate Bank Account.</li><li>To carry out foreign exchange transactions.</li><li>For applying for trade license, and import and export license.</li><li>For applying for Government loans.</li><li>For making applications for Certificate of Occupancy.</li><li>For filing annual income tax returns.</li><li>For filing annual summaries (i.e. for persons required to deduct tax at source).</li><li>For accounting for Value Added Tax (VAT).</li></ol></div><div class=\"section\"><h3>How to Apply for Tax Identification Number as a Registered Business in Nigeria</h3><p>A registered business is a corporate taxpayer in Nigeria and therefore required to apply for Tax Identification Number (TIN).</p><p>TIN can be applied for by either:</p><ul><li>Visiting the nearest FIRS office in person; or</li><li>Requesting for a Tax Identification Number online through the Joint Tax Board (JTB).</li></ul><h3>A. Requirements for procuring a TIN by visiting the nearest FIRS office in person</h3><ol type=\"i\"><li>Business Name Registration Certificate;</li><li>Application letter for VAT/TIN registration. This should be typed on the business name letter head and addressed to the FIRS office;</li><li>Duly filled and officially stamped VAT Form 001;</li><li>Official Business Stamp; and</li><li>Utility bill.</li></ol><p><strong>NOTE:</strong> The original copies and two photocopies of each document should be taken along. However, the original documents are only required for sighting.</p><h3>B. Requirements for requesting a TIN online through the Joint Tax Board (JTB)</h3><ol type=\"a\"><li>A valid email address that will be used during the application process.</li><li>A registered mobile phone number.</li><li>Fill all other information accurately.</li></ol><p>This option allows for online application on the Joint Tax Board (JTB)’s portal at <a href=\"https://tin.jtb.gov.ng/TinRequestExternal\">https://tin.jtb.gov.ng/TinRequestExternal</a>. You will be required to fill the form. The TIN is expected to be created within 48 hours.</p></div><div class=\"section\"><h3>Conclusion</h3><p>Obtaining a Tax Identification Number (TIN) is not just a legal obligation but a critical step toward seamless business operations in Nigeria. TIN serves a fundamental requirement for financial and regulatory transactions.</p><p>The Federal Inland Revenue Service (FIRS) and the Joint Tax Board (JTB) have streamlined the application process for TIN registration by offering both in-person and online registration.</p><p class=\"footer\">Beyond obtaining TIN, navigating tax obligations can be complex. If you require assistance with TIN registrations, tax filings or compliance advisory, our team at ROOTHE-KHARIS & PARTNERS is ready to help. Contact us today for tailored support to keep proper financial records and stay tax compliant.</p></div></body></html>"
  },
  {
    "link": "understanding-the-deed-of-assent-transferring-legal-title-to-beneficiaries-under-a-will",
    "image": "electricity1.jpg",
    "image2": "electricity2.jpg",
    "title": " Overview of The Lagos State Electricity Law 2024",
    "text": "On 3rd December 2024, the Executive Governor of Lagos State, Mr. Babajide Sanwo-Olu, signed the Lagos State Electricity Bill into law, thereby enacting the Lagos State Electricity Law, 2024 (“LSEL”).",
    "date": "13 Jun 2025",
    "content": "<body><h1>Overview of the Lagos State Electricity Law 2024</h1><div class=\"section\"><h3>Introduction</h3><p>On 3rd December 2024, the Executive Governor of Lagos State, Mr. Babajide Sanwo-Olu, signed the Lagos State Electricity Bill into law, thereby enacting the Lagos State Electricity Law, 2024 (“LSEL”). This landmark legislation repeals the Lagos Electric Power Sector Reform Law of 2018 and introduces a comprehensive framework for the creation and regulation of the Lagos Electricity Market (the “Market”). The LSEL aims to ensure the efficient management of electricity generation, the distribution of reliable power supply, and the attraction of investment to the Lagos State Electricity Market.</p><p>The LSEL aligns with the Fifth Alteration Act No. 33 of the Constitution of the Federal Republic of Nigeria (the “Constitution”) (as amended) and the Electricity Act, 2023 (as amended) (the “EA”), which empowers states in Nigeria to regulate the generation, transmission, and distribution of electricity within their jurisdictions. This decentralization aims to reduce reliance on the national grid and promote private sector investment in the electricity sector across the country.</p><p>As Nigeria’s commercial hub, Lagos State contributes approximately 30% of the national Gross Domestic Product (GDP) and 50% of the non-oil GDP. This economic significance underscores the necessity for an independent electricity law that not only attracts investment but also serves as a model for other states to emulate. With an estimated population of 16.5 million people, Lagos is the most populous city in Nigeria, necessitating consistent power supply to support its rapidly growing population and economic activities. Reliable electricity is critical for infrastructure development, economic growth, job creation, environmental sustainability, social development, and urban planning.</p><p>Currently, Lagos State’s economic activities are heavily reliant on generators powered by expensive and environmentally harmful fuels such as fuel oil, petrol, and diesel. This dependence on unreliable and costly power sources continues to hinder the state’s economic growth. As Lagos continues to expand, reliable electricity serves as a cornerstone for supporting its infrastructural development, environmental sustainability, and overall progress.</p><p>It is imperative to note that no modern economy can thrive amidst inadequate and unreliable electricity supply. Recognizing this, Lagos State has enacted the Lagos State Electricity Law, 2024, to address these challenges and create a sustainable energy future.</p></div><div class=\"section\"><h3>Key Provisions of the Lagos State Electricity Law, 2024</h3><p>The LSEL introduces a robust framework for the regulation and development of the Lagos Electricity Market.</p><ol><li><strong>Objectives of the Law:</strong><ul><li>Creating a functional electricity market in Lagos State, providing reliable, affordable, and sustainable access to electricity for all residents.</li><li>Facilitating investments and innovation in the electricity sector.</li><li>Promoting renewable energy, energy efficiency, and sustainable practices.</li><li>Electrifying unserved and underserved areas.</li></ul></li><li><strong>Regulatory Framework:</strong> The Law created several regulatory agencies such as:<ul><li><strong>Lagos State Electricity Regulatory Commission</strong> <span class=\"reference\">[Section 5 of the LSEL 2024]</span> provides a framework for licensing, market regulation, and consumer protection. Licensing is mandatory for all major electricity activities, including generation, distribution, and supply. These licenses are issued for a minimum of 10 years and a maximum of 20 years and there are provisions for license modification, renewal, or revocation based on performance or compliance <span class=\"reference\">[Sections 44 & 86 LSEL 2024]</span>. The Law emphasized consumer protection standards and dispute resolution mechanisms <span class=\"reference\">[Section 88 LSEL 2024]</span>.</li><li><strong>Lagos State Electrification Agency</strong> <span class=\"reference\">[Section 96 LSEL 2024]</span> tasked with implementing projects to expand electricity access particularly in unserved and underserved areas <span class=\"reference\">[Section 114 LSEL 2024]</span>.</li><li><strong>Lagos Independent System Operator (ISO)</strong> <span class=\"reference\">[Section 77 LSEL 2024]</span> established to manage electricity transmission within Lagos State.</li><li><strong>Power Enforcement Unit and Criminal Provisions</strong> <span class=\"reference\">[Section 122 LSEL 2024]</span> to ensure compliance with the Law and its regulations, and penalize illegal activities <span class=\"reference\">[Sections 122 & 125 LSEL 2024]</span>.</li></ul></li><li><strong>Sustainability and Renewable Energy</strong> <span class=\"reference\">[Section 91 LSEL 2024]</span>:<p>The Law emphasises renewable energy sources such as solar, wind, and biomass and encourages energy efficiency and demand-side management (DSM). Emissions standards have been set to ensure environmental sustainability.</p></li><li><strong>Tariff Methodology and Pricing</strong> <span class=\"reference\">[Section 81 LSEL 2024]</span>:<p>The Law regulates electricity tariffs, prioritizes transparency in tariff-setting to ensure fairness and affordability, and balances investor and consumer interests.</p></li></ol></div><div class=\"section\"><h3>Conclusion</h3><p>The enactment of the Lagos State Electricity Law, 2024, represents a strategic move towards energy independence and sustainability for Lagos State. With its strong focus on governance, innovation, and inclusivity, the LSEL lays the foundation for a decentralized and efficient electricity market. Key features such as regulatory sandboxes for innovation, targeted renewable energy sources, consumer protection measures, and the promotion of public-private partnerships signal Lagos State’s commitment to transforming its energy landscape, ensuring reliable power supply, and fostering economic growth.</p><p class=\"footer\">At Roothe-Kharis & Partners, our understanding of Nigeria’s power sector, and Lagos State Electricity market equips us to guide clients though the regulatory and commercial implications of the law, in securing licenses, navigating compliance, structuring energy projects or establishing partnerships. Our Energy, Power & Infrastructure practice area is equipped to support investors, developers, and operators seeking to participate in Lagos State’s emerging electricity market and in Nigeria’s power sector.</p></div></body></html>"
  },
    {
    "link": "understanding-the-deed-of-assent-transferring-legal-title-to-beneficiaries-under-a-will",
    "image": "funding1.jpg",
    "image2": "funding2.jpg",
    "title": " Overview of the Investments and Securities Act, 2025",
    "text": "The enactment of the Investments and Securities Act, 2025 (the ‘Act’) represents a major milestone in the development of Nigeria’s capital market regulatory regime. The ISA 2025 was enacted to modernize, consolidate, and strengthen the legal and institutional framework for investments and securities in line with global best practices.",
    "date": "13 Jun 2025",
    "content": "<body><h1>Overview of the Investments and Securities Act 2025</h1><div class=\"section\"><h3>Introduction</h3><p>The enactment of the Investments and Securities Act, 2025 (the ‘Act’) represents a major milestone in the development of Nigeria’s capital market regulatory regime. The ISA 2025 was enacted to modernize, consolidate, and strengthen the legal and institutional framework for investments and securities in line with global best practices. This legislative reform became necessary in response to the evolving complexities of the capital market, technological disruptions, the rise of digital financial assets, and Nigeria’s commitment to enhancing investor confidence, market integrity, and financial inclusion.</p><p>The Act repealed and replaced the Investments and Securities Act, 2007 particularly in its treatment of emerging financial instruments and digital innovations. By enacting the ISA 2025, the National Assembly sought to address some challenges in the 2007 Act such as regulatory gaps, enforcement limitations, and inefficiencies in dispute resolution mechanisms generally. ISA 2025 introduced a more robust framework for market supervision, enhanced the powers and independence of the Securities and Exchange Commission (SEC), expanded the regulatory scope of the SEC to cover new investment products, and strengthened investor protection. The Act also aligned Nigeria’s securities laws with international standards.</p></div><div class=\"section\"><h3>Key Innovations Under the Act</h3><ol><li><strong>Reinforcement of SEC’s Regulatory Powers to Enhance Market Oversight:</strong><p>The Act significantly reinforced the regulatory and enforcement powers of the Securities and Exchange Commission (SEC) through greater oversight over capital market operators <span class=\"reference\">[Section 3 of the Investments and Securities Act, 2025]</span>, and the powers to obtain relevant user data from telecommunications and electronic communications providers during investigations into market abuses such as insider trading, market manipulation, and fraudulent investment schemes. Tougher punishments and penalties have been prescribed for non-compliance by individuals and entities involved in ponzi schemes.</p></li><li><strong>Recognition and Regulation of Cryptocurrencies and Blockchain-Based Investments (Digital Assets):</strong><p>The Act officially classified cryptocurrencies and blockchain-based investments as securities and provided a regulatory framework for digital assets. Virtual Asset Service Providers (VASPs), Digital Asset Operators (DAOPs), and Digital Asset Exchanges are required to obtain licenses from the Securities and Exchange Commission (SEC) before operating in Nigeria.</p></li><li><strong>Categorization of Securities Exchanges:</strong><p>The Act introduced the categorization of securities exchanges <span class=\"reference\">[Section 27, ISA 2025]</span> for ease of registration, operation, and market supervision into:</p><ul><li><strong>Composite exchanges</strong> which are permitted to list, quote, and trade all types of securities, commodities, and financial instruments.</li><li><strong>Non-composite exchanges</strong> are either:<ul><li><strong>Specialized (mono) exchanges</strong> focused on the listing, quotation, and trading of a particular type of asset class (e.g. securities, financial instruments, financial products, commodities or derivatives), or</li><li><strong>Alternative trading systems (ATS)</strong>, which facilitate trading activities electronically or through physical venues without offering the full range of securities.</li></ul></li></ul></li><li><strong>New Provisions for Financial Market Infrastructure (FMIs):</strong><p>The Act provided a regulatory framework for FMIs such as Central Counterparties, Clearing Houses, and Trade Depositories <span class=\"reference\">[Section 41 and 42 ISA, 2025]</span>. Financial Market Infrastructures (FMIs) are now required to register with the Securities and Exchange Commission in order to enjoy insolvency protections such that market contracts and collateral actions are protected from the application of general insolvency laws.</p></li><li><strong>Management of Systemic Risk:</strong><p>The Act empowered the Securities and Exchange Commission (SEC) to monitor and manage systemic risks in the capital market <span class=\"reference\">[Section(s) 82 to 84 ISA 2025]</span> including issuing directives such as the suspension of trading where necessary in order to maintain market stability.</p></li><li><strong>Commodities Exchange and Warehouse Regulation:</strong><p>The Act introduced tougher regulatory requirements for the operation of commodity exchanges, clearing houses, and warehouse operators <span class=\"reference\">[Section 222 to 229 ISA 2025]</span> including fines and imprisonment for non-compliance with the mandatory registration SEC.</p></li><li><strong>Mandatory Use of Legal Entity Identifiers (LEIs):</strong><p>The Act mandated the use of Legal Entity Identifiers (LEIs) by all market participants in securities transactions to enhance transparency and traceability <span class=\"reference\">[Section 123 ISA 2025]</span>. LEIs are globally recognized tools for improving market surveillance, preventing fraud, and facilitating efficient risk management across the financial system.</p></li></ol><p>The Act complies with the International Organization of Securities Commissions (IOSCO) principles, the Enhanced Multilateral Memorandum of Understanding (EMMoU), and positions Nigeria’s capital market within the global regulatory mainstream to enhance cross-border cooperation and facilitate smoother international market participation.</p><p>Generally, the reinforced regulatory oversight of the SEC, the formal recognition and regulation of digital assets and virtual asset service providers, the stipulation of clear penalties for fraud, and robust protection for investors under the Act are aimed at improving trust in the Nigerian capital market a critical factor for both retail and institutional participation. However, effectively enforcing the regulation of digital assets without stifling innovation requires a delicate balance between other regulators such as the Central Bank of Nigeria (CBN) and the National Information Technology Development Agency (NITDA).</p></div><div class=\"section\"><h3>Conclusion</h3><p>The Investments and Securities Act, 2025 marks a transformative shift in Nigeria’s capital market framework. By replacing the outdated ISA 2007 with a modern, innovation-driven, and globally aligned regulatory regime, the ISA 2025 signals Nigeria’s renewed commitment to fostering transparency, investor confidence, and market resilience.</p><p>If properly implemented, the Act has the potential to elevate Nigeria as a premier investment destination in Africa, capable of attracting both local and international capital, driving sustainable economic growth, and expanding financial inclusion. However, its long-term impact will hinge on the strategic implementation of the Act by an effective collaboration among regulators, market stakeholders, and policymakers, as well as ongoing regulatory clarity and institutional capacity building.</p><p class=\"footer\">The ISA 2025 presents new opportunities for investors, issuers, and intermediaries and at Roothe-Kharis & Partners, we are committed to guiding our clients through this evolving regulatory landscape with expert legal advisory and tailored capital market solutions. Do not hesitate to contact us if you have any questions or require further clarifications.</p></div></body></html>"
  }
]
