[
  {
    "link": "the-extent-of-a-third-party-participation-at-a-companys-meeting/",
    "image": "image1.jpg",
    "image2": "image2.jpg",
    "title": " The Extent of a Third Party Participation at a Company's Meeting",
    "text": " A board meeting is a formal gathering of the directors of a company to deliberate on company affairs and make strategic decisions.",
    "date": "19 Mar 2025",

    "content": "\n<span>Introduction</span>\n<span>A board meeting is a formal gathering of the directors of a company to deliberate on company affairs and make strategic decisions. The primary attendees of a board meeting are the directors of the company. The Companies and Allied Matters Act, 2020 (CAMA 2020) governs the composition, rights, and procedures of board meetings in Nigeria.</span>\n\n<span>According to Section 289(1) of CAMA 2020, every company is required to hold board meetings, and these meetings must be attended by the directors who are responsible for managing the company’s affairs. By the provisions of Section 335 of CAMA 2020, a company secretary has a right to attend board meetings because of their role in ensuring that the company complies with applicable rules and regulations. Section 335(2) CAMA 2020 provides that “The secretary shall not, without the authority of the board, exercise any power vested in the directors.” This implies that the secretary does not have any power to make decisions at the board meeting.</span>\n\n<span>Occasionally, companies invite third parties, such as consultants, legal advisors, or auditors, to provide expert insights during board meetings. However, the extent to which such third parties can participate, particularly whether they can move or adopt motions, is subject to Corporate Governance principles and statutory regulations, primarily governed by CAMA 2020 and relevant corporate governance codes in Nigeria.</span>\n\n<span>Legal Framework for Board Meetings in Nigeria</span>\n<span>Section 305 CAMA 2020 stipulates that directors are responsible for the general management of a company’s business, including the initiation and adoption of motions during board meetings. This responsibility is exclusive to directors and cannot be delegated to non-directors unless expressly provided in the company’s articles or through a valid board resolution. The directors, in discharging their managerial duties, can invite third parties as advisers or experts to provide guidance on technical matters, such as regulatory compliance, financial structuring, or strategic planning. However, their participation or role at the meeting remains advisory and not voting participation.</span>\n\n<span>The Nigerian Code of Corporate Governance (NCCG) 2018, issued by the Financial Reporting Council of Nigeria (FRCN), reinforces that while external professionals such as consultants may provide valuable advice and expertise during board meetings, they do not possess the statutory authority to make binding decisions or to propose and adopt motions during meetings. Their role is advisory, supporting the board’s decision-making process without substituting the directors’ responsibility.</span>\n\n<span>Legal Implication of a Motion Moved/Adopted by a Third Party at a Company’s Board Meeting</span>\n<span>Given the statutory framework discussed above, the implication of a third-party active participation in a company’s meeting will result in the following:</span>\n<ol>\n    <li><strong>Lack of Legal Authority:</strong> A third party, not being a member of the board, lacks the legal authority to move or adopt motions. Any motion initiated by such a third party would not satisfy the procedural requirements laid down by CAMA 2020 and the company’s articles of association.</li>\n    <li><strong>Procedural Invalidity:</strong> Since board decisions must be made solely by directors, a motion moved or adopted by a third party is procedurally flawed. In effect, any decision arising from such a motion would be considered invalid, as it does not reflect a proper exercise of the board’s power.</li>\n    <li><strong>Void or Voidable Decisions:</strong> Where a board inadvertently allows a third party to interfere in the decision-making process during a meeting, such a decision may be challenged on the grounds that it was adopted through an improper process. Courts or regulatory bodies may then deem the decision void or voidable, undermining its enforceability.</li>\n    <li><strong>Breach of Governance Protocols:</strong> Permitting a third party to move or adopt a motion undermines the integrity of the board’s decision-making process. It may indicate a lapse in adherence to corporate governance best practices, potentially leading to internal disputes or conflicts of interest.</li>\n</ol>\n\n<span>Conclusion</span>\n<span>Under Nigerian law, specifically the provisions of CAMA 2020 and the Nigerian Code of Corporate Governance, only directors are authorized to move and adopt motions during board meetings. A consultant or adviser as third parties do not have the legal capacity to do so. Any motion moved or adopted by a third party is legally invalid, and decisions based on such motions may be challenged and potentially nullified. Companies must adhere strictly to their internal governance frameworks to ensure that decision-making authority remains solely with duly appointed directors, thereby safeguarding the company’s legal and operational integrity. While consultants or advisers may provide indispensable advice, it is imperative that their role remains advisory. Directors should ensure that all formal motions and resolutions are initiated, seconded, and adopted exclusively by the board, thereby upholding the provisions of CAMA and Corporate Governance.</span>\n We serve as Company Secretaries to companies in diverse industries. </span>\n\n</body>\n</html>"
  },
  {
    "link": "understanding-the-new-tenancy-law-of-lagos-state-what-landlords-need-to-know/",
    "image": "landlord.jpg",
    "image2": "landlord2.jpg",
    "title": " Understanding The New Tenancy Law Of Lagos State: What Landlords Need To Know",
    "text": "Landlords, property managers, and real estate investors play a critical role in the housing ecosystem of Lagos State.",
    "date": "26 Mar 2025",

    "content": "<!DOCTYPE html>\n<html lang=\"en\">\n<head>\n    <meta charset=\"UTF-8\">\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">\n    <span>1. Introduction:</span>\n<span>Landlords, property managers, and real estate investors play a critical role in the housing ecosystem of Lagos State. This critical role makes it essential to stay informed about the laws that govern the relationships between landlords, property managers, and tenants.</span>\n\n<span>The Lagos State Tenancy Law of 2011 is one of such recent but critical pieces of legislation that every landlord, property manager, or real estate investor should understand in order to operate successfully and avoid legal pitfalls.</span>\n\n<span>2. An Overview of the New Tenancy Law of Lagos State</span>\n<span>The Tenancy Law was enacted to regulate the relationship between landlords and tenants in Lagos State and provide the framework for the creation, operation, and termination of tenancy agreements while protecting the rights and obligations of the parties, and provides the procedure for the recovery of premises.</span>\n<span>The law applies to all commercial and residential premises within Lagos State (S. 1), excluding Apapa, Ikeja G.R.A., Ikoyi, and Victoria Island.</span>\n\n<span>3. The Rights and Responsibilities of Landlords under the Tenancy Law</span>\n<span>Who is a \"Tenant\" under the Tenancy Law?</span>\n<span>The law defines a tenant as any person who occupies any premises by the payment of rent, or by the operation of law NOT any person who unlawfully occupies under a bonafide claim to be the owner.</span>\n\n<span>Who is a \"Landlord\" under the Tenancy Law?</span>\n<span>The law defines a landlord as any person who receives any rent (whether in his own right or as an attorney or agent) from any person for the occupation of any premises in respect of which he has a right to receive such rent. A former landlord, an attorney, solicitor, agent, or caretaker of a landlord is also described as a landlord.</span>\n\n<span>4. The Creation of Tenancy</span>\n<span>By the definition of who a tenant is, we see that a tenancy is created by an agreement which is deemed to have been created where a landlord grants a person who pays value, the right to the use of his premises. Such an agreement can be made expressly or impliedly, orally, in writing, partly oral or partly written, or for a fixed period (e.g., shortlets, Airbnb, etc). According to this definition, a tenant can either be an individual or a business entity.</span>\n\n<span>5. What Landlords Must Know in Relation to Business Premises</span>\n<ul>\n    <li>A landlord should not:</li>\n    <li>Significantly prevent a tenant’s access to business premises.</li>\n    <li>Extensively obstruct the flow of customers, clients, or other persons using the tenant’s business premises.</li>\n    <li>Cause or fail to remove anything that may disturb a tenant’s trade within the business premises such that would amount to a loss of profit for the tenant.</li>\n    <li>Fail to rectify the breakdown of plant or equipment under his care or maintenance as soon as possible.</li>\n</ul>\n\n<span>6. Rent Control</span>\n<span>What does \"Rents\" mean under the Tenancy Law?</span>\n<span>What qualifies as rent includes any consideration or money paid or agreed to be paid or value or a right given or agreed to be given or part of any crop rendered or any equivalent given in kind or in labour, in consideration of which a landlord has permitted any person to use and occupy any land, premises, or other corporeal hereditament, and the use of common areas but does not include any charge for services or facilities provided in addition for the occupation of the premises.</span>\n\n<span>It is a criminal offence for a landlord to:</span>\n<ul>\n    <li>demand or receive from an existing monthly tenant, six (6) months’ rent in advance.</li>\n    <li>demand or receive from an existing yearly tenant, one (1) year rent in advance.</li>\n    <li>demand or receive from a new or proposed tenant, one (1) year in advance.</li>\n</ul>\n\n<span>A landlord who demands rent in advance will be guilty of an offence and liable to 100,000 fine or three (3) months imprisonment.</span>\n\n<span>7. Rent Increment: Rights of a Tenant and How They Affect Landlords</span>\n<span>Often asked questions: what happens in a situation where after the landlord has increased rent, the tenant refused to pay the increased rent?</span>\n<span>An existing tenant can apply to the court for an order declaring that the increase in rent under the tenancy agreement is unreasonable. The court will then consider the following:</span>\n<ul>\n    <li>The rent payable in the same locality generally.</li>\n    <li>Evidence of the landlord and the tenant.</li>\n    <li>Special circumstances necessitating the increase in rent e.g., a new amenity has been included, etc.</li>\n</ul>\n\n<span>The tenant can apply to the court to pay the current rent to the court’s registry. The landlord will then be required to approach the court to receive the rent but a sum amounting to 10% of the rent will be deducted by the court before handing over the rent to the landlord.</span>\n\n<span>In <em>JOVINCO NIGERIA LTD & ANOR V. IBEOZIMAKO (2014) LPELR-23599(CA)</em>, the court held that a landlord cannot unilaterally increase rent. An increment in rent must be supported by an agreement – since the landlord and tenancy relationship is a contractual relationship.</span>\n\n<span>In <em>COBRA LTD V. OMOLE ESTATE AND INVESTMENT LTD (2000) 1 NWLR (Pt. 655)</em>, the court held that unless there is an agreement between the landlord and the tenant, a landlord’s unilateral decision to increase rent is ineffective. See also, <em>UDIHI V. IZEDOMWEN (1990) 2 NWLR (Pt. 132), 357 at 366</em>.</span>\n\n<span>In a more recent case of <em>CHISCO TRANSPORT (NIG) LTD V. NJOKU & ORS (2024) LPELR-62333 (CA)</em>, the court held that a landlord does not possess the power to unilaterally increase rent. The matter of rent increment must be supported by an agreement to that effect.</span>\n\n<span>8. Rights of a Landlord</span>\n<ul>\n    <li>Right to obtain a court order to re-enter and end the tenancy if the tenant breaches any covenants of the tenancy agreement.</li>\n    <li>Right to apply for court order for possession on the grounds that the premises is being used for immoral or illegal purposes, the premises has been abandoned, the premises is unsafe and unsound as to constitute a danger to human life or property, an act of intolerable nuisance by the tenant such that induces a breach of the tenancy agreement.</li>\n    <li>Right to recover the premises where a fixed tenancy has ended.</li>\n    <li>The 7 days notice of Owner’s intention to recover possession has been served on the tenant.</li>\n</ul>\n\n<span>9. Landlords Obligations</span>\n<ul>\n    <li>Issue payment receipt to tenants for the payment of rent. A landlord who fails to issue a rent payment receipt is guilty of an offence and liable to pay a fine of N100,000.</li>\n    <li>Issue a separate receipt for the payment of security deposit to cover damages and repairs to the premises, services and facilities, service charge.</li>\n    <li>Not to disturb the tenant's quiet and peaceable enjoyment of the premises. Peace and quiet enjoyment include the tenant’s right to privacy, freedom from unreasonable disturbance, exclusive possession of the premises, right to common areas for reasonable and lawful purpose.</li>\n    <li>Pay all rates and charges as stipulated by law e.g., land use charge, LAWMA, etc.</li>\n    <li>Keep the premises insured against loss or damage e.g., providing security.</li>\n    <li>Not terminate or restrict the use of a common facility or service for the use of the premises.</li>\n    <li>Not seize any item or property of the tenant or interfere with the tenant's access to his personal property.</li>\n    <li>Effect repairs and maintain the external and common parts of the premises.</li>\n</ul>\n\n<span>10. How a Tenancy is Terminated</span>\n<ul>\n    <li>By notice to quit:</li>\n    <ul>\n        <li>One week’s notice for a tenant at will.</li>\n        <li>One (1) month’s notice for a monthly tenant.</li>\n        <li>Three (3) months’ notice for a quarterly tenant.</li>\n        <li>Three (3) months’ notice for a half-yearly tenant.</li>\n        <li>Six months’ notice for a yearly tenant.</li>\n        <li>Tenancy for a fixed term: at the end of the tenancy/7 days notice of owner’s intention to recover possession.</li>\n        <li>Licensees are entitled to a 7 days notice of owner's intention to apply to recover possession.</li>\n    </ul>\n    <li>By court order</li>\n</ul>\n\n<span>11. Illegal/Unlawful Ways to Terminate a Tenancy</span>\n<ul>\n    <li>By harassment – wilfully removing the roof of the building, disconnecting electricity supply or water supply.</li>\n    <li>Forcefully ejecting a tenant while an action is pending in court against the increment of rent.</li>\n    <li>Threatening or molesting a tenant by action or words.</li>\n</ul>\n\n<span>These actions are illegal and unlawful and carry liability in law. A landlord who commits any of these illegal acts is guilty of an offence and liable to a fine not exceeding N250,000 or a maximum of six (6) months imprisonment.</span>\n\n<span>12. General Limitations a Landlord Should Be Aware Of</span>\n<ul>\n    <li>Rent advance limitation</li>\n    <li>Eviction limitation – i.e., without following legal procedures.</li>\n    <li>Rent review limitations</li>\n</ul>\n\n<span>13. Strategies for Mitigating These Limitations</span>\n<ul>\n    <li>Landlords should conduct thorough tenant screening to reduce default risks.</li>\n    <li>Drafting airtight tenancy agreements that clarify all obligations.</li>\n    <li>Ensure compliance with statutory notices for eviction and rent increases.</li>\n    <li>Immediately take legal action when tenants default to minimize delays.</li>\n</ul>\n\n<span>14. Resolving Disputes Under the Law</span>\n<span>The Tenancy Law promotes alternative ways of amicably resolving disputes between a landlord and tenant such as reconciliation and mediation. However, the court can refer a tenancy dispute to mediation (at the Citizen Mediation Centre or to the Lagos Multi-Door Court House) without the consent of the landlord and the tenant (S. 32).</span>\n<span>An agreement known as a mediation agreement is typically executed at the end of mediation and enforced by the court.</span>\n\n<span>15. Conclusion</span>\n<span>The Tenancy Law of Lagos State 2011 is a comprehensive legal framework designed to balance the interests of landlords and tenants while promoting fairness and stability in the rental market. It emphasizes the importance of written agreements, proper notice periods, and due process in resolving disputes. Both landlords and tenants are encouraged to familiarize themselves with the Law to ensure compliance and avoid legal pitfalls.</span>\n\n<span>At Roothe-Kharis, we specialize in guiding both landlords and tenants through the complexities of laws and regulations, ensuring compliance and minimizing legal risks. Whether you are a property owner seeking to protect your investment or a tenant aiming to understand your rights, our expert team is here to provide tailored solutions and unparalleled support.</span>\n\n<span>Do not hesitate to contact us if you have any questions or require further clarifications on this article. Let us help you unlock the full potential of your property or tenancy experience with confidence and peace of mind.</span>\n\n</body>\n</html>"
  },

  {
    "link": "legal-considerations-in-real-estate-investment-and-development-in-nigeria/",
    "image": "estate.jpg",
    "image2": "estate2.jpg",
    "title": "  Legal Considerations In Real Estate Investment And Development In Nigeria",
    "text": " In Nigeria, real estate investment and development is widely recognized as a profitable and stable venture, offering long-term financial benefits. ",
    "date": "26 Mar 2025",

    "content": "<html><head></head><body><span>Introduction</span><span>In Nigeria, real estate investment and development is widely recognized as a profitable and stable venture, offering long-term financial benefits. However, the acquisition and development of real property are subject to complex legal and regulatory frameworks that must be carefully navigated to ensure compliance and mitigate risks. Failure to adhere to these legal requirements may result in financial losses, disputes, or regulatory sanctions.</span><span>This article examines some key legal considerations in real estate investment and development in Nigeria, focusing on the legal framework for real estate investment and development, the verification of title, contractual obligations, and conflict resolution mechanisms.</span><span>As an investment asset, the tangible characteristic of real estate provides a sense of investment security unlike stocks and bonds. Regardless of market fluctuations, property value generally increases over time, making real estate an attractive long-term investment. Furthermore, the development of commercial and residential properties can provide an excellent passive income through lease payments, when properly managed.</span><span>In relation to development, a piece of real estate (for example, a bare land) can be developed for residential or commercial use by improving its physical aesthetics or such improvements that may enhance its value, or for a future sale.</span><span>1. Right to the ownership of real estate in Nigeria</span><span>The Constitution of the Federal Republic of Nigeria, 1999 (as amended) provides that '…every citizen of Nigeria shall have the right to acquire and own immovable property anywhere in Nigeria.' This forms the bedrock of the legal rights to the ownership of real estate (as an immovable) property in Nigeria.</span><span>Historically, the original ownership of real estate arose by either one of the following: deforestation/first settlement of a virgin land, conquest during inter-tribal wars, etc. In recent years, the ownership of real estate may devolve by a sale or purchase, or by inheritance through a clear and uncontroverted traditional history, or by gift, or by a customary grant, etc.</span><span>In rural areas, Customary right in the ownership of land is still practised in Nigeria wherein only a community, a village, or a family can exercise ownership to land or real estate – not an individual. In order for the sale or purchase of community land to be valid, several requirements must be fulfilled including the payment of a purchase price, the delivery of possession, and the presence of witnesses.</span><span>However, ownership of land in urban areas is subject to the Land Use Act 1978 which provides that '…all lands in urban areas shall be under the control and management of the Governor of each state…'.</span><span>2. The verification of title</span><span>The verification of an interest or title to a piece of real estate involves practical and procedural steps taken to confirm the legal ownership, validity, and enforceability of the claimed interest or title. This process typically includes:</span><ul><li>Reviewing the title documents,</li><li>Conducting due diligence,</li><li>Verifying encumbrances,</li><li>Checking compliance with regulatory requirements,</li><li>Ensuring there are no pre-existing disputes or defects that could affect the property’s marketability or transferability.</li></ul><span>In EFCC & ANOR V. IBRAHIM, Justice Peter Chudi Obiorah noted that 'it is not in the pages of newspapers that encumbrances on landed properties are registered.'</span><span>Title to a piece of real estate can be verified by traditional history/evidence, by duly authenticated and verified documents, by acts of ownership, by proof of possession of a connected land, and by sufficient acts of possession over a long period of time.</span><span>3. Foreign investment restrictions</span><span>In a plethora of decided cases, the Courts have held that the application of the Land Use Act 1978 is wholly for the benefit of Nigerians. However, a foreigner seeking to invest in Nigeria may do so subject to the provisions of the Nigerian Investment Promotion Commission Act, the Companies and Allied Matters Act, 2020, and under the close monitoring of the Foreign Exchange (Monitoring & Miscellaneous Provisions) Act amongst other applicable laws.</span><span>4. Compliance with zoning regulations</span><span>In Nigeria, land zoning and planning are governed by a combination of federal, state, and local government regulations. Zoning involves the systematic division of land into distinct zones based on designated purposes such as residential, agricultural, commercial, industrial, or recreational uses. Land zoning is aimed at optimizing land use, promoting orderly development, ensuring efficient resource allocation, and fostering sustainable and well-structured communities.</span><span>Non-compliance with zoning laws may result in regulatory sanctions, demolition orders, or avoidable legal disputes. In 2024, several buildings were demolished in Lagos State due to non-compliance with the Lagos State Urban and Regional Planning and Development (Amendment) Law 2019.</span><span>5. Taxation</span><span>It is important to note that investing in real estate attracts several taxes including capital gains tax charged at a flat rate of 10% on the profit from the sale of a property, stamp duty tax charged ad-valorem on the documents of transfer and varies according to each state law and the document type, others are company income tax, and personal income tax.</span><span>6. Conflict resolution mechanisms</span><span>Conflict may arise at any time within real estate investment and development cycle from land ownership and title disputes, breach of contract, regulatory non-compliance, opposition from the community, the list is endless. Effective conflict resolution mechanisms are crucial to maintaining investor confidence, ensuring project continuity, and a stable real estate market.</span><span>In Nigeria, real estate conflicts are governed by the Land Use Act 1978, the Urban and Regional Planning Act, contract law, state laws, the civil procedure rules of each state, other relevant laws, regulations, and policies.</span><span>Depending on the nature of the conflict, resolution may be pursued in court through litigation, or through alternatives such as negotiation, mediation, arbitration, or regulatory intervention.</span><span>BEST PRACTICES FOR PREVENTING CONFLICT IN REAL ESTATE TRANSACTIONS</span><span>At Roothe-Kharis & Partners, we understand that real estate investment and development require a strategic approach that balances legal compliance, commercial viability, and risk management. With extensive expertise in real estate transactions, Roothe-Kharis provides tailored legal solutions that support clients throughout the entire property lifecycle - from acquisition and financing to development, management, and exit strategies.</span><span>Our team is well versed in land title verification, joint venture structuring, project financing, zoning and planning regulations, conflict prevention and resolution mechanisms.</span><span>In line with our commitment to delivering end-to-end legal solutions, we highlight below key practices to ensure that stakeholders operate with legal certainty and commercial confidence:</span><ul><li>Early consultation with experts: engaging legal, financial, and technical experts at the outset of a real estate transaction or development project would help identify and mitigate potential risks before they escalate. Early legal intervention ensures proper structuring, regulatory compliance and due diligence.</li><li>Comprehensive due diligence: investors and developments must conduct thorough title verification, regulatory compliance checks, and community engagements before acquiring real estate.</li><li>Well-structured contracts: whether advising institutional investors, developers, financiers, or private clients, clearly drafted agreements, including dispute resolution clauses, help prevent ambiguities that may lead to conflicts.</li><li>Stakeholder engagements: proactive consultation with government agencies, host communities, and regulatory bodies can mitigate disputes.</li><li>ADR mechanisms: considering the time and cost implications of litigation, ADR mechanisms should be deployed at the earliest possible signs of a conflict.</li></ul><span>CONCLUSION</span><span>Navigating the legal landscape of real estate investment and development in Nigeria requires a thorough understanding of the regulatory framework, compliance requirements, and risk mitigation strategies. From land acquisition and title verification to zoning laws and contractual agreements, investors must be well-informed to avoid legal pitfalls and ensure profitable ventures.</span><span>Engaging experienced legal professionals is crucial to safeguarding investments and achieving long-term success in this dynamic sector. Our deep expertise in real estate law makes us well-versed in providing comprehensive advisory and legal services tailored to the unique needs of our clients. By partnering with Roothe-Kharis, investors can confidently make informed decisions, minimize risks, and maximize the potential of their real estate investments in Nigeria.</span><span>Do not hesitate to contact us if you are seeking to explore new opportunities or expand your investment portfolios. Roothe-Kharis offers personalized legal solutions and strategic insights to help clients unlock growth and achieve their business objectives in Nigeria’s thriving real estate market.</span></body></html>"
  },
  {
    "link": "understanding-the-deed-of-assent-transferring-legal-title-to-beneficiaries-under-a-will",
    "image": "deed.jpg",
    "image2": "deed2.jpg",
    "title": " Understanding The Deed Of Assent: Transferring Legal Title To Beneficiaries Under a Will",
    "text": " A Deed of Assent is an instrument or legal document that comes into existence in furtherance of the devolution of title to real property to beneficiaries under a Will.",
    "date": "26 Mar 2025",
    "content": "<span>Introduction</span>\n<span>A Deed of Assent is an instrument or legal document that comes into existence in furtherance of \nthe devolution of title to real property to beneficiaries under a Will. It is important to state that a \nwill in itself cannot confer title or ownership on a beneficiary, it only accords a named beneficiary \nan equitable interest in the property gifted to him while a deed of assent accords a legal title or \nownership to the property. A named beneficiary in a Will cannot assume legal title or ownership \nof any property gifted to him until a deed of assent has been executed in his favour.</span>\n\n<span>A deed of assent serves the purpose of conferring legal ownership of a gift in a Will on the named \nbeneficiaries or a third party by Executors or Administrators of an estate. Where a deed of assent \nhas been duly executed in favour of the beneficiaries, a third party cannot subsequently lay claims \nto the properties that have been duly passed on to the intended beneficiaries.</span>\n\n<span>Section 40 of the Administration of Estate Law of Lagos State provides for the effect of assent by \nthe personal representative. It states that “a personal representative may assent to the vesting in any \nperson who either by devise, bequest, devolution, appropriation or otherwise, may be entitled to, either \nbeneficiary or as a trustee or personal representative, of any estate or interest in real estate to which the \ntestator or intestate was entitled or over which he exercised a general power of appointment by his will \nand which devolved upon the personal representative.”</span>\n\n<span>Conditions for a Valid Assent</span>\n<ul>\n<li>An assent to the vesting of a legal estate shall be in writing.</li>\n<li>It shall be signed by the personal representative.</li>\n<li>It shall name the person in whose favour it is given.</li>\n<li>It shall operate to vest in that person the legal estate to which it relates.</li>\n<li>An assent not in writing or not in favour of a named person shall not be effectual to \npass a legal estate.</li>\n</ul>\n\n<span>Checklist of the Requirements for Registration</span>\n<ul>\n<li>An application letter addressed to the Registrar of Titles requesting to register a deed \nof assent with a functional phone number and email address.</li>\n<li>Two copies of the Deed of Assent/ Vesting Deed.</li>\n<li>Deed must be dated, signed, and each page initialed.</li>\n<li>Passport photographs of all the administrators/executors to be attached to the deed.</li>\n<li>The front cover of the deed must be signed and sealed by the solicitor who prepared \nthe deed.</li>\n<li>Spiral/bookbinding.</li>\n<li>A certified true copy of the root of title.</li>\n<li>A certified true copy of the letter of administration/ Will.</li>\n<li>A sworn affidavit deposed to by the administrators/executors attesting to the vesting.</li>\n<li>Original for sighting and one copy of the valid means of identification of all the \nadministrators/executors.</li>\n<li>Payment receipt.</li>\n</ul>\n\n<span>Conclusion</span>\n<span>A Deed of Assent is so important in the devolution of the estate of the deceased. The title in a \nproperty cannot pass to the intended named beneficiary or any third party without a duly \nexecuted deed of assent, which must be signed by the Executors or Administrators to the Will. \nAnd as earlier stated, once it has fulfilled the conditions highlighted above, a third party cannot \nlay claims to the properties of the deceased already passed on to the beneficiaries.</span>\n\n<span>Roothe-Kharis is a team of lawyers well versed in drafting legal contracts, wills and codicils. Do not hesitate to\ncontact us if you have any questions or require further clarifications on this article. We are available to provide \nthe support you need in navigating and distilling the fine prints of a testamentary document.</span>\n"
  },
  {
    "link": "understanding-the-deed-of-assent-transferring-legal-title-to-beneficiaries-under-a-will",
    "image": "fixed.jpg",
    "image2": "fixed2.jpg",
    "title": " The Fixed Exchange Rate Clause: Safeguarding Founders In Cross-Border Financing",
    "text": "Funding is a key aspect of every Startup. In the pursuit of capital or investments, founders often focus on other critical elements such as valuation, equity dilution, interest rates, and repayment terms.",
    "date": "9 Apr 2025",
    "content": "<h4>INTRODUCTION:</h4><span>Funding is a key aspect of every Startup. In the pursuit of capital or investments, founders often focus on other critical elements such as valuation, equity dilution, interest rates, and repayment terms. However, a frequently overlooked but pivotal detail in transactions involving funding in foreign currencies or transactions involving foreign investors is the <b>exchange rate.</b></span><span>A characteristic feature of emerging markets such as Nigeria is the stability (or not) of its economy. Considering that most private equity (and venture capital) funds are domiciled in USD, GBP, and Euro, oversight of the exchange rate can have far-reaching financial implications, especially in economies with volatile currencies.</span><span>This article sheds some insight into a seemingly simple yet profoundly impactful tool Startup founders can use to mitigate currency exchange risks, ensuring financial predictability and stability for founders navigating cross-border financing.</span><h4>THE FIXED EXCHANGE RATE CLAUSE:</h4><span>The Fixed Exchange Rate clause (also known as the <b>'Pegging Clause'</b>) is a contractual provision that establishes a predetermined exchange rate for financial transactions, regardless of the subsequent fluctuations in the currency market. By locking in the exchange rate at the outset, this clause ensures that repayment obligations are consistent, shielding parties from the adverse effects of currency volatility.</span><span>It is commonplace for Startups, particularly those operating in emerging markets, to raise capital in foreign currencies while conducting business in local currencies. Without a fixed exchange rate, founders risk facing exponentially higher repayment costs in the event of currency depreciation. For example, a Nigerian Startup that secures $100,000 in funding when the exchange rate was ₦800/$1 would be required to pay nearly double the amount in Naira at the time of repayment should the Naira depreciate to ₦1,500/$1 (as was evident in 2024) - without a fixed exchange rate clause. Conversely, with an agreed exchange rate in place, the repayment obligation would remain tied to the initial rate of ₦800/$1, preserving the startup's financial stability and ensuring predictable cash flow management.</span><h4>BENEFITS OF THE FIXED EXCHANGE RATE CLAUSE:</h4><span>In addition to the benefits highlighted above, the Fixed Exchange Rate Clause offers several other benefits to founders (mostly). These benefits include:</span><ol><li><strong>Clarity and certainty in repayment obligations.</strong> Effectively incorporating a fixed exchange clause provides an unambiguous understanding of repayment terms - both for the investors and the founder and further minimizes the potential for disputes arising from exchange rate fluctuations.</li><li><strong>Increased Investor confidence:</strong> Investors are usually more confident in negotiating with founders who demonstrate sound financial understanding and a proactive approach to risk management, thereby streamlining negotiations by eliminating uncertainty related to currency exchange risks.</li><li><strong>Protection against currency volatility:</strong> The Fixed Exchange Rate Clause safeguards founders in emerging markets (and frontier markets) from the unexpected financial strain caused by currency depreciation and encourages long-term financial planning and forecasting.</li></ol><h4>A SIMPLE GUIDE TO DRAFTING A FIXED EXCHANGE RATE CLAUSE:</h4><span>Start by specifying the exchange rate to be used for repayment. Then, indicate the date on which the exchange rate is determined (for example, the commencement date, the signing date, the disbursement date, etc). It is helpful to define the currencies involved in funding and repayment, and finally, outline the process for resolving disagreements related to the application of the exchange rate.</span><h4>CONCLUSION:</h4><span>The Fixed Exchange Rate Clause is an indispensable tool for founders engaged in cross-border financing. Incorporating a Fixed Exchange Rate Clause offers protection against currency volatility and ensures financial predictability, while safeguarding the interests of founders.</span><span>At Roothe-Kharis, we specialize in providing expert legal guidance to founders navigating the complexities of cross-border transactions. Our team is committed to crafting tailored solutions that protect your interests and ensure compliance with applicable laws. We are available for consultations to secure the financial future of founders who are seeking to achieve business objectives with confidence. Contact us today to learn more about how we can support your growth journey.</span>"
  },
  {
    "link": "understanding-the-deed-of-assent-transferring-legal-title-to-beneficiaries-under-a-will",
    "image": "joint1.jpg",
    "image2": "joint2.jpg",
    "title": "Joint Venture Agreements (JVAS) in Nigeria: A guide for Businesses and Investors",
    "text": "A Joint Venture Agreement (JVA) is a legal contract between two or more parties who agree to collaborate on a specific business project while maintaining their separate legal identities.",
    "date": "21 Apr 2025",
    "content": "<div class=\"section\"><span>1.0 Introduction</span><p>A Joint Venture Agreement (JVA) is a legal contract between two or more parties who agree to collaborate on a specific business project while maintaining their separate legal identities. This agreement outlines the rights, responsibilities, profit-sharing arrangements, and governance structure of the joint venture. Businesses often enter into JVAs to combine resources, expertise, and market access for mutual benefit, especially in industries such as real estate, technology, energy, and manufacturing.</p><p>Joint ventures provide several strategic advantages, including risk-sharing, cost reduction, and accelerated market entry. By pooling their strengths, businesses can achieve goals that may be difficult to accomplish independently. However, JVAs also come with potential challenges, such as cultural differences, management conflicts, and regulatory risks. These challenges highlight the importance of a well-structured agreement that clearly defines roles, contributions, and dispute resolution mechanisms.</p></div><div class=\"section\"><span>Importance of Joint Ventures in Business and Economic Growth</span><ol><li><strong>Leveraging Resources:</strong> One of the most significant advantages of a JV is the ability to pool resources from multiple entities. This can include financial capital, technology, production capabilities, or distribution networks. When companies collaborate, they can enhance efficiency and innovation, ultimately leading to increased productivity and competitive advantage.</li><li><strong>Reducing Costs:</strong> Joint ventures allow companies to achieve economies of scale, reducing per-unit production costs and sharing operational expenses such as labor, marketing, and supply chain costs. In industries that require high investment in technology or infrastructure, a JV makes it more feasible to implement costly advancements while mitigating financial risk.</li><li><strong>Combining Expertise:</strong> JVs enable businesses to exchange knowledge, skills, and best practices. For example, a company with strong research and development (R&D) capabilities can partner with another company that excels in market penetration. This cross-industry or cross-sector collaboration drives innovation and efficiency, leading to enhanced product offerings and better customer satisfaction.</li><li><strong>Entering Foreign Markets:</strong> JVs are particularly valuable when entering foreign markets, especially in regions with legal restrictions on foreign direct investment (FDI). Many countries impose ownership restrictions that limit foreign companies from operating independently. In such cases, a JV with a local partner provides the necessary legal access, while also benefiting from the local entity's market knowledge, distribution channels, and regulatory compliance expertise.</li><li><strong>Regulatory Restrictions on Foreign Business Entry:</strong> Joint Venture Agreement(s) serve as a strategic entry mode for businesses facing legal and regulatory barriers in foreign markets. By forming partnerships with local firms, companies can navigate legal complexities, minimize risks, and accelerate market penetration, thereby contributing to economic growth through trade expansion, job creation, and technology transfer. For example, countries like China, India, and Indonesia have historically imposed restrictions requiring foreign companies to form joint ventures with local businesses. Also, the Nigerian Oil and Gas Industry Content Development Act (2010) promotes local participation, requiring foreign companies to partner with Nigerian firms to carry out oil and gas operations.</li></ol></div><div class=\"section\"><span>2.0 Types of Joint Ventures</span><h3>2.1 Corporate (or Equity) Joint Venture</h3><p>A Corporate or Equity Joint Venture is a business arrangement where two or more parties provide capital, assets, or other resources in agreed proportions to establish a new legal entity (mostly a joint venture limited liability company), sharing ownership (by shareholding), profits, and risks. In this type of arrangement, the parties carry on business that involves expertise provided by each of them. An important document in this type of arrangement is the shareholders agreement and the articles of association.</p><h3>2.2 Contractual (Unincorporated) Joint Ventures</h3><p>A Contractual Joint Venture (CJV) is a business arrangement where two or more parties (which could be businesses or individuals) collaborate based on a legally binding agreement rather than forming a separate legal entity. Each party retains ownership of its assets and operates independently while sharing responsibilities, risks, and profits according to the contract terms. Examples of Contractual Joint Ventures include agency agreements, distribution agreements, franchise agreements, intellectual property license agreements, collaboration agreements, consortium agreements, partnership agreements, cross-supply agreements, etc.</p></div><div class=\"section\"><span>Elements of a Joint Venture Agreement</span><p>One of the most important elements of a strong joint venture agreement is the definition of clear objectives and roles. The agreement must explicitly state the purpose of the joint venture, ensuring that all parties are aligned on the goals and expected outcomes. Additionally, each party's role, responsibilities, and contributions - whether financial, technical, or operational - should be clearly outlined. This prevents misunderstandings and ensures that each partner understands their obligations. Defining the scope of the venture, including its geographic reach, market focus, and duration, further enhances clarity and strategic direction.</p><p>A comprehensive financial and governance structure is another essential component of an effective JVA. The agreement should specify how profits, losses, and expenses will be distributed among the partners. It must also outline the ownership structure, specifying whether the joint venture will operate as a partnership, corporation, or limited liability entity. Furthermore, the governance framework should establish decision-making processes, voting rights, and the authority of each partner. Defining financial commitments, such as funding requirements, capital contributions, and reinvestment strategies, ensures financial stability and transparency throughout the partnership.</p><p>Disputes are common in business collaborations, making it crucial to incorporate strong dispute resolution mechanisms within the agreement. A well-drafted JVA should outline procedures for handling conflicts, including mediation, arbitration, or litigation. This ensures that disputes are resolved efficiently without damaging the long-term viability of the partnership. Additionally, the agreement should define the steps for addressing breaches of contract, deadlocks, or partner disagreements. Including provisions for amendments or modifications to the agreement further allows the joint venture to adapt to changing business conditions.</p><p>Conducting due diligence and compliance checks play a critical role in securing the joint venture's legitimacy and long-term success. A good agreement should ensure that the joint venture adheres to local and international laws, including corporate regulations, tax requirements, and competition laws. Conducting due diligence on each partner's financial and legal standing before formalizing the agreement helps mitigate risks.</p><p>Intellectual property (IP) rights, confidentiality, and non-compete clauses should also be included to protect business assets and prevent unfair competition. Moreover, having a well-defined exit strategy, including buyout options, asset distribution, and dissolution procedures, allows partners to disengage from the joint venture smoothly if necessary.</p><p>Drafting an airtight joint venture agreement requires careful planning and attention to detail. By clearly defining objectives, financial structures, dispute resolution mechanisms, and legal compliance requirements, businesses can establish a joint venture that fosters transparency, collaboration, and long-term success. An effective agreement not only safeguards the interests of all parties involved but also creates a solid foundation for achieving shared business goals.</p></div><div class=\"section\"><span>Conclusion</span><p>Joint ventures (JVs) present businesses with an opportunity to expand, innovate, and leverage complementary strengths. However, they require careful planning, clear agreements, and legal compliance to ensure success.</p><p>For businesses and investors considering joint ventures, clear objectives, robust governance, and structured dispute resolution mechanisms are critical. Thorough legal due diligence ensures compliance and safeguards intellectual property, while expert guidance in drafting agreements helps mitigate risks and adapt to changing conditions. Equally important is ensuring cultural and strategic alignment among partners to prevent conflicts.</p><p>Looking ahead, joint ventures will be shaped by globalization, digital transformation, and emerging technologies like AI and blockchain. Cross-border collaborations will demand greater regulatory awareness, while sustainability and ESG principles will increasingly influence partnership structures.</p><p class=\"footer\">Please contact us if you need any help with joint venture agreements. At Roothe-Kharis & Partners, we specialize in structuring and reviewing joint venture agreements to ensure legal soundness and commercial viability. Contact us today for a secure and profitable arrangement.</p></div></body></html>"
  },
  {
    "link": "understanding-the-deed-of-assent-transferring-legal-title-to-beneficiaries-under-a-will",
    "image": "board1.jpg",
    "image2": "board2.jpg",
    "title": " How to determine the Quorum of Board Meetings",
    "text": "Ensuring a valid quorum is essential for any productive board of directors meeting.",
    "date": "21 Apr 2025",
    "content": "<title>How to Determine the Quorum for a Board of Directors Meeting</title></head><body><h1>HOW TO DETERMINE THE QUORUM OF BOARD MEETINGS</h1><div class=\"section\"><span>Introduction</span><p>Ensuring a valid quorum is essential for any productive board of directors meeting. Without it, key decisions may be legally unenforceable, putting an organization at risk. But how exactly is the right quorum determined?</p><p>In this article, we break down the legal requirements, best practices, and common pitfalls in establishing and verifying quorum-helping directors, corporate secretaries, and executives maintain compliance and governance standards.</p><p>Sections 289, of the Companies and Allied Matters Act 2020 provides that the first meeting of the Board of Directors shall be held not later than 6 months after the incorporation of the company.</p><p>The agenda of the first board meeting should include the election of the Chairman from among the directors, the appointment of an auditor and the appointment of a Company Secretary.</p><p>The Board of Directors meeting is held from time to time to discuss major problems, areas of concern, vote on decisions, review the company's performance, and consider policies.</p></div><div class=\"section\"><span>Quorum for a Board of Directors Meeting</span><p>Section 256 (2) of the Companies and Allied Matters Act (CAMA) 2020 makes provision for the number of members of a company that constitute a quorum for the purpose of a meeting.</p><p>\"Except in the case of a company with one member or provided in the articles, the quorum for the meeting of a company is one third of the total number of members of the company or 25 members (whichever is less) present in person or by proxy, but where the number of members is not a multiple of three, then the number nearest to one third, but where the number of members is six or less, the quorum is two members and for the purpose of determining a quorum, all members or their proxies shall be counted\".</p><p>Section 290 (1) of the Companies and Allied Matters Act 2020 provides for the quorum of a board meeting as follows:</p><p>Unless the articles provide otherwise, the quorum necessary for the transaction of the business of directors are two where there are not more than six directors, but where there are more than six directors, the quorum is one-third of the number of directors, and where the number of directors is not a multiple of three, then the quorum is one third to the nearest number.</p><p>By a joint reading of Sections 256 and 290, the quorum of a meeting of a Company or of a board meeting are as follows:</p><table><tr><th>S/N</th><th>Company Member</th><th>Quorum</th></tr><tr><td>1</td><td>1</td><td>1 member</td></tr><tr><td>2</td><td>More than 1</td><td>1/3 or 25 members</td></tr><tr><td>3</td><td>6 or less</td><td>2 members</td></tr><tr><td>4</td><td>6 and more</td><td>1/3 - One third means \"one of three equal parts of a divisible whole\". i.e 6 can be divided into 3 equal parts by 2.</td></tr></table><p>Scenario 1: Plum Ltd has 3 members, what is the quorum for a board meeting?</p><p>Answer: 3 ÷ 3 = 1 the quorum will be 2 members because 2 is greater than One third.</p><p>Scenario 2: Plum Ltd has 5 members, what is the quorum for a board meeting?</p><p>Answer: 5 ÷ 3 = 1.67 Round it up to the nearest whole number = 2 members</p><p>Scenario 3: Plum Ltd has 7 members, what is the quorum for a board meeting?</p><p>Answer: 7 ÷ 3 = 2.33. Round it up to the nearest whole number = 3 members</p><p>In all instances for the purpose of determining a quorum, all members of a company or their proxies shall be counted.</p><p>The quorum requirements outlined above are applicable to virtual board meetings as permitted under a company's articles of association. See Section 240(2) of the Companies and Allied Matters Act 2020.</p></div><div class=\"section\"><span>Conclusion</span><p>Determining and maintaining a proper quorum is not just a procedural formality. It is a legal safeguard that upholds the integrity of the board's decisions. Whether your organization follows statutory defaults or custom bylaws, understanding quorum, how to calculate it, and its requirements helps prevent disputes, ensures compliance, and keeps corporate governance on solid footing.</p><p>As hybrid and remote meetings become more common, boards must adapt their practices to confirm quorum efficiently while meeting legal standards. Proactive planning, clear bylaws, and proper record-keeping are key to avoiding challenges down the line.</p><p class=\"footer\">If your board needs guidance on quorum rules, governance best practices, or corporate compliance, ROOTHE-KHARIS & PARTNERS' experienced corporate attorneys are here to help. Contact us today for tailored advice that keeps your organization protected and productive.</p></div></body></html>"
  },
  {
    "link": "understanding-the-deed-of-assent-transferring-legal-title-to-beneficiaries-under-a-will",
    "image": "tax1.jpg",
    "image2": "tax2.jpg",
    "title": " Key tax registeration requirements for Businesses and Individuals",
    "text": "One of the key requirements of a business upon registration/ incorporation is to apply for a Tax Identification Number (TIN). The TIN is a unique number that identifies a registered business for the purposes of paying taxes.",
    "date": "21 Apr 2025",
    "content": "<title>Key Tax Registration Requirements for Businesses and Individuals</title></head><body><h1>KEY TAX REGISTRATION REQUIREMENTS FOR BUSINESSES AND INDIVIDUALS</h1><div class=\"section\"><span>INTRODUCTION</span><p>One of the key requirements of a business upon registration/ incorporation is to apply for a Tax Identification Number (TIN). The TIN is a unique number that identifies a registered business for the purposes of paying taxes.</p><p>The TIN is prepared and issued by the Federal Inland Revenue Services (FIRS). Section 8(1)(b) of the FIRS Establishment Act 2007 empowers the FIRS to register Tax Payers and issue a TIN, and the Joint Tax Board (JTB) is empowered by Section 86(1) of the Personal Income Tax act (PITA). TIN is issued to individuals or registered businesses/incorporated companies for proper tax identification and verification.</p></div><div class=\"section\"><span>BENEFITS OF OBTAINING A TAX IDENTIFICATION NUMBER (TIN)</span><p>Some of the benefits and advantages enjoyed for obtaining Tax Identification Number include the following:</p><ol><li>For obtaining a Tax Clearance Certificate (businesses).</li><li>For opening a Corporate Bank Account.</li><li>To carryout foreign exchange transactions.</li><li>For applying for trade license, and import and export license.</li><li>For applying for Government loans.</li><li>For making applications for Certificate of Occupancy.</li><li>For filing annual income tax returns.</li><li>For filing annual summaries (i.e. for persons required to deduct tax at source.</li><li>For accounting for Value Added Tax (VAT).</li></ol></div><div class=\"section\"><span>HOW TO APPLY FOR TAX IDENTIFICATION NUMBER AS A REGISTERED BUSINESS IN NIGERIA</span><p>A registered business is a corporate taxpayer in Nigeria and therefore required to apply for Tax Identification Number (TIN).</p><p>TIN can be applied for by either</p><ol type=\"A\"><li>visiting the nearest FIRS office in person; or</li><li>requesting for a Tax Identification Number online through the Joint Tax Board (JTB).</li></ol><h3>A. REQUIREMENTS for procuring a TIN by visiting the nearest FIRS office in person</h3><ol type=\"i\"><li>Business Name Registration Certificate;</li><li>Application letter for VAT/TIN registration. This should be typed on the business name letter head and addressed to the FIRS office;</li><li>Duly filled and officially stamped VAT Form 001;</li><li>Official Business Stamp; and</li><li>Utility bill.</li></ol><p>NOTE: The original copies and two photocopies of each document should be taken along. However, the original documents are only required for sighting.</p><h3>B. Requirements for requesting a TIN online through the Joint Tax Board (JTB)</h3><ol type=\"a\"><li>A valid email address that will be used during the application process.</li><li>A registered mobile phone number.</li><li>Fill all other information accurately.</li></ol><p>This option allows for online application on the Joint Tax Board (JTB)'s portal at <a href=\"https://tin.jtb.gov.ng/TinRequestExternal\">https://tin.jtb.gov.ng/TinRequestExternal</a>. You will be required to fill the form. The TIN is expected to be created within 48 hours.</p></div><div class=\"section\"><span>CONCLUSION</span><p>Obtaining a Tax Identification Number (TIN) is not just a legal obligation but a critical step toward seamless business operations in Nigeria. TIN serves a fundamental requirement for financial and regulatory transactions.</p><p>The Federal Inland Revenue Service (FIRS) and the Joint Tax Board (JTB) have streamlined the application process for TIN registration by offering both in-person and online registration.</p><p>Beyond obtaining TIN, navigating tax obligations can be complex. If you require assistance with TIN registrations, tax filings or compliance advisory, our team at ROOTHE-KHARIS & PARTNERS is ready to help. Contact us today for tailored support to keep proper financial records and stay tax compliant.</p></div></body></html>"
  }
]
